[
  {
    "index": "rage",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Rage",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You can imbue yourself with a primal power called Rage, a force that grants you extraordinary might and resilience. You can enter it as a Bonus Action if you aren't wearing Heavy armor.",
      "You can enter your Rage the number of times shown for your Barbarian level in the Rages column of the Barbarian Features table. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.",
      "While active, your Rage follows the rules below.",
      "Damage Resistance. You have Resistance to Bludgeoning, Piercing, and Slashing damage.",
      "Rage Damage. When you make an attack using Strength—with either a weapon or an Unarmed Strike—and deal damage to the target, you gain a bonus to the damage that increases as you gain levels as a Barbarian, as shown in the Rage Damage column of the Barbarian Features table.",
      "Strength Advantage. You have Advantage on Strength checks and Strength saving throws.",
      "No Concentration or Spells. You can't maintain Concentration, and you can't cast spells.",
      "Duration. The Rage lasts until the end of your next turn, and it ends early if you don Heavy armor or have the Incapacitated condition. If your Rage is still active on your next turn, you can extend the Rage for another round by doing one of the following:",
      "• Make an attack roll against an enemy.",
      "• Force an enemy to make a saving throw.",
      "• Take a Bonus Action to extend your Rage.",
      "Each time the Rage is extended, it lasts until the end of your next turn. You can maintain a Rage for up to 10 minutes."
    ],
    "url": "/api/2024/features/rage"
  },
  {
    "index": "unarmored-defense-barbarian",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Unarmored Defense",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "While you aren't wearing any armor, your base Armor Class equals 10 plus your Dexterity and Constitution modifiers. You can use a Shield and still gain this benefit."
    ],
    "url": "/api/2024/features/unarmored-defense-barbarian"
  },
  {
    "index": "weapon-mastery-barbarian",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Weapon Mastery",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Your training with weapons allows you to use the mastery properties of two kinds of Simple or Martial Melee weapons of your choice, such as Greataxes and Handaxes. Whenever you finish a Long Rest, you can practice weapon drills and change one of those weapon choices.",
      "When you reach certain Barbarian levels, you gain the ability to use the mastery properties of more kinds of weapons, as shown in the Weapon Mastery column of the Barbarian Features table."
    ],
    "url": "/api/2024/features/weapon-mastery-barbarian"
  },
  {
    "index": "danger-sense",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Danger Sense",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You gain an uncanny sense of when things aren't as they should be, giving you an edge when you dodge perils. You have Advantage on Dexterity saving throws unless you have the Incapacitated condition."
    ],
    "url": "/api/2024/features/danger-sense"
  },
  {
    "index": "reckless-attack",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Reckless Attack",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You can throw aside all concern for defense to attack with increased ferocity. When you make your first attack roll on your turn, you can decide to attack recklessly. Doing so gives you Advantage on attack rolls using Strength until the start of your next turn, but attack rolls against you have Advantage during that time."
    ],
    "url": "/api/2024/features/reckless-attack"
  },
  {
    "index": "barbarian-subclass",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Barbarian Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Barbarian subclass of your choice. The Path of the Berserker subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Barbarian levels. For the rest of your career, you gain each of your subclass's features that are of your Barbarian level or lower."
    ],
    "url": "/api/2024/features/barbarian-subclass"
  },
  {
    "index": "primal-knowledge",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Primal Knowledge",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain proficiency in another skill of your choice from the skill list available to Barbarians at level 1.",
      "In addition, while your Rage is active, you can channel primal power when you attempt certain tasks; whenever you make an ability check using one of the following skills, you can make it as a Strength check even if it normally uses a different ability: Acrobatics, Intimidation, Perception, Stealth, or Survival. When you use this ability, your Strength represents primal power coursing through you, honing your agility, bearing, and senses."
    ],
    "url": "/api/2024/features/primal-knowledge"
  },
  {
    "index": "ability-score-improvement-barbarian-4",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Barbarian levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-barbarian-4"
  },
  {
    "index": "extra-attack-barbarian",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Extra Attack",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "You can attack twice instead of once whenever you take the Attack action on your turn."
    ],
    "url": "/api/2024/features/extra-attack-barbarian"
  },
  {
    "index": "fast-movement",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Fast Movement",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "Your speed increases by 10 feet while you aren't wearing Heavy armor."
    ],
    "url": "/api/2024/features/fast-movement"
  },
  {
    "index": "feral-instinct",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Feral Instinct",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "Your instincts are so honed that you have Advantage on Initiative rolls."
    ],
    "url": "/api/2024/features/feral-instinct"
  },
  {
    "index": "instinctive-pounce",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Instinctive Pounce",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "As part of the Bonus Action you take to enter your Rage, you can move up to half your Speed."
    ],
    "url": "/api/2024/features/instinctive-pounce"
  },
  {
    "index": "ability-score-improvement-barbarian-8",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Ability Score Improvement",
    "level": 8,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-barbarian-8"
  },
  {
    "index": "brutal-strike",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Brutal Strike",
    "level": 9,
    "prerequisites": [],
    "desc": [
      "If you use Reckless Attack, you can forgo any Advantage on one Strength-based attack roll of your choice on your turn. The chosen attack roll mustn't have Disadvantage. If the chosen attack roll hits, the target takes an extra 1d10 damage of the same type dealt by the weapon or Unarmed Strike, and you can cause one Brutal Strike effect of your choice. You have the following effect options.",
      "Forceful Blow. The target is pushed 15 feet straight away from you. You can then move up to half your Speed straight toward the target without provoking Opportunity Attacks.",
      "Hamstring Blow. The target's Speed is reduced by 15 feet until the start of your next turn. A target can be affected by only one Hamstring Blow at a time—the most recent one."
    ],
    "url": "/api/2024/features/brutal-strike"
  },
  {
    "index": "relentless-rage",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Relentless Rage",
    "level": 11,
    "prerequisites": [],
    "desc": [
      "Your Rage can keep you fighting despite grievous wounds. If you drop to 0 Hit Points while your Rage is active and don't die outright, you can make a DC 10 Constitution saving throw. If you succeed, your Hit Points instead change to a number equal to twice your Barbarian level.",
      "Each time you use this feature after the first, the DC increases by 5. When you finish a Short or Long Rest, the DC resets to 10."
    ],
    "url": "/api/2024/features/relentless-rage"
  },
  {
    "index": "ability-score-improvement-barbarian-12",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Ability Score Improvement",
    "level": 12,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-barbarian-12"
  },
  {
    "index": "improved-brutal-strike-13",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Improved Brutal Strike",
    "level": 13,
    "prerequisites": [],
    "desc": [
      "You have honed new ways to attack furiously. The following effects are now among your Brutal Strike options.",
      "Staggering Blow. The target has Disadvantage on the next saving throw it makes, and it can't make Opportunity Attacks until the start of your next turn.",
      "Sundering Blow. Before the start of your next turn, the next attack roll made by another creature against the target gains a +5 bonus to the roll. An attack roll can gain only one Sundering Blow bonus."
    ],
    "url": "/api/2024/features/improved-brutal-strike-13"
  },
  {
    "index": "persistent-rage",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Persistent Rage",
    "level": 15,
    "prerequisites": [],
    "desc": [
      "When you roll Initiative, you can regain all expended uses of Rage. After you regain uses of Rage in this way, you can't do so again until you finish a Long Rest.",
      "In addition, your Rage is so fierce that it now lasts for 10 minutes without you needing to do anything to extend it from round to round. Your Rage ends early if you have the Unconscious condition (not just the Incapacitated condition) or don Heavy armor."
    ],
    "url": "/api/2024/features/persistent-rage"
  },
  {
    "index": "ability-score-improvement-barbarian-16",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Ability Score Improvement",
    "level": 16,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-barbarian-16"
  },
  {
    "index": "improved-brutal-strike-17",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Improved Brutal Strike",
    "level": 17,
    "prerequisites": [],
    "desc": [
      "The extra damage of your Brutal Strike increases to 2d10. In addition, you can use two different Brutal Strike effects whenever you use your Brutal Strike feature."
    ],
    "url": "/api/2024/features/improved-brutal-strike-17"
  },
  {
    "index": "indomitable-might",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Indomitable Might",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "If your total for a Strength check or Strength saving throw is less than your Strength score, you can use that score in place of the total."
    ],
    "url": "/api/2024/features/indomitable-might"
  },
  {
    "index": "epic-boon-barbarian",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see \"Feats\") or another feat of your choice for which you qualify. Boon of Irresistible Offense is recommended."
    ],
    "url": "/api/2024/features/epic-boon-barbarian"
  },
  {
    "index": "primal-champion",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "name": "Primal Champion",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "You embody primal power. Your Strength and Constitution scores increase by 4, to a maximum of 25."
    ],
    "url": "/api/2024/features/primal-champion"
  },
  {
    "index": "bardic-inspiration",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Bardic Inspiration",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You can supernaturally inspire others through words, music, or dance. This inspiration is represented by your Bardic Inspiration die, which is a d6.",
      "Using Bardic Inspiration. As a Bonus Action, you can inspire another creature within 60 feet of yourself who can see or hear you. That creature gains one of your Bardic Inspiration dice. A creature can have only one Bardic Inspiration die at a time.",
      "Once within the next hour when the creature fails a D20 Test, the creature can roll the Bardic Inspiration die and add the number rolled to the d20, potentially turning the failure into a success. A Bardic Inspiration die is expended when it's rolled.",
      "Number of Uses. You can confer a Bardic Inspiration die a number of times equal to your Charisma modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.",
      "At Higher Levels. Your Bardic Inspiration die changes when you reach certain Bard levels, as shown in the Bardic Die column of the Bard Features table. The die becomes a d8 at level 5, a d10 at level 10, and a d12 at level 15."
    ],
    "url": "/api/2024/features/bardic-inspiration"
  },
  {
    "index": "spellcasting-bard",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Spellcasting",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have learned to cast spells through your bardic arts. See \"Spells\" for the rules on spellcasting. The information below details how you use those rules with Bard spells, which appear in the Bard spell list later in the class's description.",
      "Cantrips. You know two cantrips of your choice from the Bard spell list. Dancing Lights and Vicious Mockery are recommended.",
      "Whenever you gain a Bard level, you can replace one of your cantrips with another cantrip of your choice from the Bard spell list.",
      "When you reach Bard levels 4 and 10, you learn another cantrip of your choice from the Bard spell list, as shown in the Cantrips column of the Bard Features table.",
      "Spell Slots. The Bard Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended slots when you finish a Long Rest.",
      "Prepared Spells of Level 1+. You prepare the list of level 1+ spells that are available for you to cast with this feature. To start, choose four level 1 spells from the Bard spell list. Charm Person, Color Spray, Dissonant Whispers, and Healing Word are recommended.",
      "The number of spells on your list increases as you gain Bard levels, as shown in the Prepared Spells column of the Bard Features table. Whenever that number increases, choose additional spells from the Bard spell list until the number of spells on your list matches the number on the table. The chosen spells must be of a level for which you have spell slots.",
      "If another Bard feature gives you spells that you always have prepared, those spells don't count against the number of spells you can prepare with this feature, but those spells otherwise count as Bard spells for you.",
      "Changing Your Prepared Spells. Whenever you gain a Bard level, you can replace one spell on your list with another Bard spell for which you have spell slots.",
      "Spellcasting Ability. Charisma is your spellcasting ability for your Bard spells.",
      "Spellcasting Focus. You can use a Musical Instrument as a Spellcasting Focus for your Bard spells."
    ],
    "url": "/api/2024/features/spellcasting-bard"
  },
  {
    "index": "expertise-bard-2",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Expertise",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You gain Expertise (see \"Rules Glossary\") in two of your skill proficiencies of your choice. Performance and Persuasion are recommended if you have proficiency in them.",
      "At Bard level 9, you gain Expertise in two more of your skill proficiencies of your choice."
    ],
    "url": "/api/2024/features/expertise-bard-2"
  },
  {
    "index": "jack-of-all-trades",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Jack of All Trades",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You can add half your Proficiency Bonus (round down) to any ability check you make that uses a skill proficiency you lack and that doesn't otherwise use your Proficiency Bonus.",
      "For example, if you make a Strength (Athletics) check and lack Athletics proficiency, you can add half your Proficiency Bonus to the check."
    ],
    "url": "/api/2024/features/jack-of-all-trades"
  },
  {
    "index": "bard-subclass",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Bard Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Bard subclass of your choice. The College of Lore subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Bard levels. For the rest of your career, you gain each of your subclass's features that are of your Bard level or lower."
    ],
    "url": "/api/2024/features/bard-subclass"
  },
  {
    "index": "ability-score-improvement-bard-4",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Bard levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-bard-4"
  },
  {
    "index": "font-of-inspiration",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Font of Inspiration",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "You now regain all your expended uses of Bardic Inspiration when you finish a Short or Long Rest.",
      "In addition, you can expend a spell slot (no action required) to regain one expended use of Bardic Inspiration."
    ],
    "url": "/api/2024/features/font-of-inspiration"
  },
  {
    "index": "countercharm",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Countercharm",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "You can use musical notes or words of power to disrupt mind-influencing effects. If you or a creature within 30 feet of you fails a saving throw against an effect that applies the Charmed or Frightened condition, you can take a Reaction to cause the save to be rerolled, and the new roll has Advantage."
    ],
    "url": "/api/2024/features/countercharm"
  },
  {
    "index": "ability-score-improvement-bard-8",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Ability Score Improvement",
    "level": 8,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-bard-8"
  },
  {
    "index": "expertise-bard-9",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Expertise",
    "level": 9,
    "prerequisites": [],
    "desc": [
      "You gain Expertise in two more of your skill proficiencies of your choice."
    ],
    "url": "/api/2024/features/expertise-bard-9"
  },
  {
    "index": "magical-secrets",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Magical Secrets",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "You've learned secrets from various magical traditions. Whenever you reach a Bard level (including this level) and the Prepared Spells number in the Bard Features table increases, you can choose any of your new prepared spells from the Bard, Cleric, Druid, and Wizard spell lists, and the chosen spells count as Bard spells for you (see a class's section for its spell list). In addition, whenever you replace a spell prepared for this class, you can replace it with a spell from those lists."
    ],
    "url": "/api/2024/features/magical-secrets"
  },
  {
    "index": "ability-score-improvement-bard-12",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Ability Score Improvement",
    "level": 12,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-bard-12"
  },
  {
    "index": "ability-score-improvement-bard-16",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Ability Score Improvement",
    "level": 16,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-bard-16"
  },
  {
    "index": "superior-inspiration",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Superior Inspiration",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "When you roll Initiative, you regain expended uses of Bardic Inspiration until you have two if you have fewer than that."
    ],
    "url": "/api/2024/features/superior-inspiration"
  },
  {
    "index": "epic-boon-bard",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see \"Feats\") or another feat of your choice for which you qualify. Boon of Spell Recall is recommended."
    ],
    "url": "/api/2024/features/epic-boon-bard"
  },
  {
    "index": "words-of-creation",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "name": "Words of Creation",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "You have mastered two of the Words of Creation: the words of life and death. You therefore always have the Power Word Heal and Power Word Kill spells prepared. When you cast either spell, you can target a second creature with it if that creature is within 10 feet of the first target."
    ],
    "url": "/api/2024/features/words-of-creation"
  },
  {
    "index": "spellcasting-cleric",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Spellcasting",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have learned to cast spells through prayer and meditation. See \"Spells\" for the rules on spellcasting. The information below details how you use those rules with Cleric spells, which appear on the Cleric spell list later in the class's description.",
      "Cantrips. You know three cantrips of your choice from the Cleric spell list. Guidance, Sacred Flame, and Thaumaturgy are recommended.",
      "Whenever you gain a Cleric level, you can replace one of your cantrips with another cantrip of your choice from the Cleric spell list.",
      "When you reach Cleric levels 4 and 10, you learn another cantrip of your choice from the Cleric spell list, as shown in the Cantrips column of the Cleric Features table.",
      "Spell Slots. The Cleric Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended slots when you finish a Long Rest.",
      "Prepared Spells of Level 1+. You prepare the list of level 1+ spells that are available for you to cast with this feature. To start, choose four level 1 spells from the Cleric spell list.",
      "The number of spells on your list increases as you gain Cleric levels, as shown in the Prepared Spells column of the Cleric Features table. Whenever that number increases, choose additional spells from the Cleric spell list until the number of spells on your list matches the number on the table. The chosen spells must be of a level for which you have spell slots.",
      "If another Cleric feature gives you spells that you always have prepared, those spells don't count against the number of spells you can prepare with this feature, but those spells otherwise count as Cleric spells for you.",
      "Changing Your Prepared Spells. Whenever you finish a Long Rest, you can change your list of prepared spells, replacing any number of spells with other Cleric spells for which you have spell slots.",
      "Spellcasting Ability. Wisdom is your spellcasting ability for your Cleric spells.",
      "Spellcasting Focus. You can use a Holy Symbol as a Spellcasting Focus for your Cleric spells."
    ],
    "url": "/api/2024/features/spellcasting-cleric"
  },
  {
    "index": "divine-order",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Divine Order",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have dedicated yourself to one of the following sacred roles of your choice.",
      "Protector. You gain proficiency with Martial weapons and training with Heavy armor.",
      "Thaumaturge. You know one additional cantrip from the Cleric spell list. In addition, your mystical connection to the divine allows you to use a Holy Symbol as a Spellcasting Focus for any spell you cast that has a Material component."
    ],
    "url": "/api/2024/features/divine-order"
  },
  {
    "index": "channel-divinity",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Channel Divinity",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You can channel divine energy directly from the Outer Planes, using that energy to fuel magical effects. You start with two such effects: Divine Spark and Turn Undead, each of which is described below. Each time you use your Channel Divinity, you choose which effect to create.",
      "You can use your Channel Divinity twice, and you regain all expended uses when you finish a Short or Long Rest. You gain additional uses when you reach certain Cleric levels, as shown in the Channel Divinity column of the Cleric Features table.",
      "If a Channel Divinity effect requires a saving throw, the DC equals 8 + your Wisdom modifier + your Proficiency Bonus.",
      "Divine Spark. As a Magic action, you point your Holy Symbol at another creature you can see within 30 feet of yourself and either heal or harm it (your choice). If you heal it, the creature regains Hit Points equal to 1d8 + your Wisdom modifier. If you harm it, the creature must make a Constitution saving throw. On a failed save, the creature takes Necrotic damage equal to 1d8 + your Wisdom modifier. On a successful save, the creature takes half as much damage.",
      "You roll an additional d8 when you reach Cleric levels 7 (2d8), 13 (3d8), and 18 (4d8).",
      "Turn Undead. As a Magic action, you present your Holy Symbol and censure Undead creatures. Each Undead of your choice within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it has the Frightened condition for 1 minute or until it takes any damage, whichever comes first. While Frightened in this way, the creature must spend its turns trying to move as far away from you as it can, and it can't willingly move to a space within 30 feet of you. The creature also can't take Reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there's nowhere to move, the creature can use the Dodge action."
    ],
    "url": "/api/2024/features/channel-divinity"
  },
  {
    "index": "cleric-subclass",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Cleric Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Cleric subclass of your choice. The Life Domain subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Cleric levels. For the rest of your career, you gain each of your subclass's features that are of your Cleric level or lower."
    ],
    "url": "/api/2024/features/cleric-subclass"
  },
  {
    "index": "ability-score-improvement-cleric-4",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Cleric levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-cleric-4"
  },
  {
    "index": "sear-undead",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Sear Undead",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "Whenever you use Turn Undead, you can roll a number of d8s equal to your Wisdom modifier (minimum of 1d8) and add the rolls together. Each Undead that fails its saving throw against your Turn Undead takes Radiant damage equal to the roll's total.",
      "This feature doesn't function if your Turn Undead has no effect on an Undead (due to the creature's immunity to the Frightened condition, for example)."
    ],
    "url": "/api/2024/features/sear-undead"
  },
  {
    "index": "ability-score-improvement-cleric-8",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Ability Score Improvement",
    "level": 8,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-cleric-8"
  },
  {
    "index": "divine-intervention",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Divine Intervention",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "You can call on your deity or pantheon to intervene on your behalf when your need is great. As a Magic action, choose any Cleric spell of level 5 or lower that doesn't require a Reaction to cast. As part of the same Magic action, you cast that spell without expending a spell slot. You can't cast a spell in this way again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/divine-intervention"
  },
  {
    "index": "ability-score-improvement-cleric-12",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Ability Score Improvement",
    "level": 12,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-cleric-12"
  },
  {
    "index": "ability-score-improvement-cleric-16",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Ability Score Improvement",
    "level": 16,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-cleric-16"
  },
  {
    "index": "epic-boon-cleric",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see \"Feats\") or another feat of your choice for which you qualify. Boon of Fate is recommended."
    ],
    "url": "/api/2024/features/epic-boon-cleric"
  },
  {
    "index": "greater-divine-intervention",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "name": "Greater Divine Intervention",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "You can call on your deity or pantheon to intervene on your behalf when your need is great. As a Magic action, choose any Cleric spell of level 8 or lower that doesn't require a Reaction to cast. As part of the same Magic action, you cast that spell without expending a spell slot. Once you use this feature, you can't use it again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/greater-divine-intervention"
  },
  {
    "index": "spellcasting-druid",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Spellcasting",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have learned to cast spells through studying the mystical forces of nature. See \"Spells\" for the rules on spellcasting. The information below details how you use those rules with Druid spells, which appear on the Druid spell list later in the class's description.",
      "Cantrips. You know two cantrips of your choice from the Druid spell list. Druidcraft and Produce Flame are recommended.",
      "Whenever you gain a Druid level, you can replace one of your cantrips with another cantrip of your choice from the Druid spell list.",
      "When you reach Druid levels 4 and 10, you learn another cantrip of your choice from the Druid spell list, as shown in the Cantrips column of the Druid Features table.",
      "Spell Slots. The Druid Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended slots when you finish a Long Rest.",
      "Prepared Spells of Level 1+. You prepare the list of level 1+ spells that are available for you to cast with this feature. To start, choose four level 1 spells from the Druid spell list. Animal Friendship, Cure Wounds, Faerie Fire, and Thunderwave are recommended.",
      "The number of spells on your list increases as you gain Druid levels, as shown in the Prepared Spells column of the Druid Features table. Whenever that number increases, choose additional spells from the Druid spell list until the number of spells on your list matches the number on the table. The chosen spells must be of a level for which you have spell slots.",
      "If another Druid feature gives you spells that you always have prepared, those spells don't count against the number of spells you can prepare with this feature, but those spells otherwise count as Druid spells for you.",
      "Changing Your Prepared Spells. Whenever you finish a Long Rest, you can change your list of prepared spells, replacing any of the spells with other Druid spells for which you have spell slots.",
      "Spellcasting Ability. Wisdom is your spellcasting ability for your Druid spells.",
      "Spellcasting Focus. You can use a Druidic Focus as a Spellcasting Focus for your Druid spells."
    ],
    "url": "/api/2024/features/spellcasting-druid"
  },
  {
    "index": "druidic",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Druidic",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You know Druidic, the secret language of Druids. While learning this ancient tongue, you also unlocked the magic of communicating with animals; you always have the Speak with Animals spell prepared.",
      "You can use Druidic to leave hidden messages. You and others who know Druidic automatically spot such a message. Others spot the message's presence with a successful DC 15 Intelligence (Investigation) check but can't decipher it without magic."
    ],
    "url": "/api/2024/features/druidic"
  },
  {
    "index": "primal-order",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Primal Order",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have dedicated yourself to one of the following sacred roles of your choice.",
      "Magician. You know one extra cantrip from the Druid spell list. In addition, your mystical connection to nature gives you a bonus to your Intelligence (Arcana or Nature) checks. The bonus equals your Wisdom modifier (minimum bonus of +1).",
      "Warden. Trained for battle, you gain proficiency with Martial weapons and training with Medium armor."
    ],
    "url": "/api/2024/features/primal-order"
  },
  {
    "index": "wild-shape",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Wild Shape",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "The power of nature allows you to assume the form of an animal. As a Bonus Action, you shape-shift into a Beast form that you have learned for this feature. You stay in that form for a number of hours equal to half your Druid level or until you use Wild Shape again, have the Incapacitated condition, or die. You can also leave the form early as a Bonus Action.",
      "Number of Uses. You can use Wild Shape twice. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.",
      "You gain additional uses when you reach certain Druid levels, as shown in the Wild Shape column of the Druid Features table.",
      "Known Forms. You know four Beast forms for this feature, chosen from among Beast stat blocks that have a maximum Challenge Rating of 1/4 and that lack a Fly Speed. The Rat, Riding Horse, Spider, and Wolf are recommended. Whenever you finish a Long Rest, you can replace one of your known forms with another eligible form.",
      "When you reach certain Druid levels, your number of known forms and the maximum Challenge Rating for those forms increases, as shown in the Beast Shapes table. In addition, starting at level 8, you can adopt a form that has a Fly Speed.",
      "Rules While Shape-Shifted. While in a form, you retain your personality, memories, and ability to speak, and the following rules apply:",
      "Temporary Hit Points. When you assume a Wild Shape form, you gain a number of Temporary Hit Points equal to your Druid level.",
      "Game Statistics. Your game statistics are replaced by the Beast's stat block, but you retain your creature type; Hit Points; Hit Point Dice; Intelligence, Wisdom, and Charisma scores; class features; languages; and feats. You also retain your skill and saving throw proficiencies and use your Proficiency Bonus for them, in addition to gaining the proficiencies of the creature.",
      "No Spellcasting. You can't cast spells, but shape-shifting doesn't break your Concentration or otherwise interfere with a spell you've already cast.",
      "Objects. Your ability to handle objects is determined by the form's limbs rather than your own. In addition, you choose whether your equipment falls in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the GM decides whether it's practical for the new form to wear a piece of equipment based on the creature's size and shape."
    ],
    "url": "/api/2024/features/wild-shape"
  },
  {
    "index": "wild-companion",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Wild Companion",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You can summon a nature spirit that assumes an animal form to aid you. As a Magic action, you can expend a spell slot or a use of Wild Shape to cast the Find Familiar spell without Material components. When you cast the spell in this way, the familiar is Fey and disappears when you finish a Long Rest."
    ],
    "url": "/api/2024/features/wild-companion"
  },
  {
    "index": "druid-subclass",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Druid Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Druid subclass of your choice. The Circle of the Land subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Druid levels. For the rest of your career, you gain each of your subclass's features that are of your Druid level or lower."
    ],
    "url": "/api/2024/features/druid-subclass"
  },
  {
    "index": "ability-score-improvement-druid-4",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Druid levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-druid-4"
  },
  {
    "index": "wild-resurgence",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Wild Resurgence",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "Once on each of your turns, if you have no uses of Wild Shape left, you can give yourself one use by expending a spell slot (no action required).",
      "In addition, you can expend one use of Wild Shape (no action required) to give yourself a level 1 spell slot, but you can't do so again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/wild-resurgence"
  },
  {
    "index": "elemental-fury",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Elemental Fury",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "The might of the elements flows through you. You gain one of the following options of your choice.",
      "Potent Spellcasting. Add your Wisdom modifier to the damage you deal with any Druid cantrip.",
      "Primal Strike. Once on each of your turns when you hit a creature with an attack roll using a weapon or a Beast form's attack in Wild Shape, you can cause the target to take an extra 1d8 Cold, Fire, Lightning, or Thunder damage (choose when you hit)."
    ],
    "url": "/api/2024/features/elemental-fury"
  },
  {
    "index": "ability-score-improvement-druid-8",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Ability Score Improvement",
    "level": 8,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-druid-8"
  },
  {
    "index": "ability-score-improvement-druid-12",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Ability Score Improvement",
    "level": 12,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-druid-12"
  },
  {
    "index": "improved-elemental-fury",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Improved Elemental Fury",
    "level": 15,
    "prerequisites": [],
    "desc": [
      "The option you chose for Elemental Fury grows more powerful, as detailed below.",
      "Potent Spellcasting. When you cast a Druid cantrip with a range of 10 feet or greater, the spell's range increases by 300 feet.",
      "Primal Strike. The extra damage of your Primal Strike increases to 2d8."
    ],
    "url": "/api/2024/features/improved-elemental-fury"
  },
  {
    "index": "ability-score-improvement-druid-16",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Ability Score Improvement",
    "level": 16,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-druid-16"
  },
  {
    "index": "beast-spells",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Beast Spells",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "While using Wild Shape, you can cast spells in Beast form, except for any spell that has a Material component with a cost specified or that consumes its Material component."
    ],
    "url": "/api/2024/features/beast-spells"
  },
  {
    "index": "epic-boon-druid",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see \"Feats\") or another feat of your choice for which you qualify. Boon of Dimensional Travel is recommended."
    ],
    "url": "/api/2024/features/epic-boon-druid"
  },
  {
    "index": "archdruid",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "name": "Archdruid",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "The vitality of nature constantly blooms within you, granting you the following benefits.",
      "Evergreen Wild Shape. Whenever you roll Initiative and have no uses of Wild Shape left, you regain one expended use of it.",
      "Nature Magician. You can convert uses of Wild Shape into a spell slot (no action required). Choose a number of your unexpended uses of Wild Shape and convert them into a single spell slot, with each use contributing 2 spell levels. For example, if you convert two uses of Wild Shape, you produce a level 4 spell slot. Once you use this benefit, you can't do so again until you finish a Long Rest.",
      "Longevity. The primal magic that you wield causes you to age more slowly. For every ten years that pass, your body ages only one year."
    ],
    "url": "/api/2024/features/archdruid"
  },
  {
    "index": "fighting-style",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Fighting Style",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have honed your martial prowess and gain a Fighting Style feat of your choice (see \"Feats\"). Defense is recommended.",
      "Whenever you gain a Fighter level, you can replace the feat you chose with a different Fighting Style feat."
    ],
    "url": "/api/2024/features/fighting-style"
  },
  {
    "index": "archery",
    "name": "Archery",
    "level": 1,
    "prerequisites": [
      "Fighting Style Feature"
    ],
    "desc": [
      "You gain a +2 bonus to attack rolls you make with Ranged weapons."
    ],
    "url": "/api/2024/features/archery"
  },
  {
    "index": "defense",
    "name": "Defense",
    "level": 1,
    "prerequisites": [
      "Fighting Style Feature"
    ],
    "desc": [
      "While you're wearing Light, Medium, or Heavy armor, you gain a +1 bonus to Armor Class."
    ],
    "url": "/api/2024/features/defense"
  },
  {
    "index": "great-weapon-fighting",
    "name": "Great Weapon Fighting",
    "level": 1,
    "prerequisites": [
      "Fighting Style Feature"
    ],
    "desc": [
      "When you roll damage for an attack you make with a Melee weapon that you are holding with two hands, you can treat any 1 or 2 on a damage die as a 3. The weapon must have the Two-Handed or Versatile property to gain this benefit."
    ],
    "url": "/api/2024/features/great-weapon-fighting"
  },
  {
    "index": "two-weapon-fighting",
    "name": "Two-Weapon Fighting",
    "level": 1,
    "prerequisites": [
      "Fighting Style Feature"
    ],
    "desc": [
      "When you make an extra attack as a result of using a weapon that has the Light property, you can add your ability modifier to the damage of that attack if you aren't already adding it to the damage."
    ],
    "url": "/api/2024/features/two-weapon-fighting"
  },
  {
    "index": "second-wind",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Second Wind",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have a limited well of physical and mental stamina that you can draw on. As a Bonus Action, you can use it to regain Hit Points equal to 1d10 plus your Fighter level.",
      "You can use this feature twice. You regain one expended use when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest.",
      "When you reach certain Fighter levels, you gain more uses of this feature, as shown in the Second Wind column of the Fighter Features table."
    ],
    "url": "/api/2024/features/second-wind"
  },
  {
    "index": "weapon-mastery-fighter",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Weapon Mastery",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Your training with weapons allows you to use the mastery properties of three kinds of Simple or Martial weapons of your choice. Whenever you finish a Long Rest, you can practice weapon drills and change one of those weapon choices.",
      "When you reach certain Fighter levels, you gain the ability to use the mastery properties of more kinds of weapons, as shown in the Weapon Mastery column of the Fighter Features table."
    ],
    "url": "/api/2024/features/weapon-mastery-fighter"
  },
  {
    "index": "action-surge",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Action Surge",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action, except the Magic action.",
      "Once you use this feature, you can't do so again until you finish a Short or Long Rest. Starting at level 17, you can use it twice before a rest but only once on a turn."
    ],
    "url": "/api/2024/features/action-surge"
  },
  {
    "index": "tactical-mind",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Tactical Mind",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You have a mind for tactics on and off the battlefield. When you fail an ability check, you can expend a use of your Second Wind to push yourself toward success. Rather than regaining Hit Points, you roll 1d10 and add the number rolled to the ability check, potentially turning it into a success. If the check still fails, this use of Second Wind isn't expended."
    ],
    "url": "/api/2024/features/tactical-mind"
  },
  {
    "index": "fighter-subclass",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Fighter Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Fighter subclass of your choice. The Champion subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Fighter levels. For the rest of your career, you gain each of your subclass's features that are of your Fighter level or lower."
    ],
    "url": "/api/2024/features/fighter-subclass"
  },
  {
    "index": "ability-score-improvement-fighter-4",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Fighter levels 6, 8, 12, 14, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-fighter-4"
  },
  {
    "index": "extra-attack-fighter",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Extra Attack",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "You can attack twice instead of once whenever you take the Attack action on your turn."
    ],
    "url": "/api/2024/features/extra-attack-fighter"
  },
  {
    "index": "tactical-shift",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Tactical Shift",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "Whenever you activate your Second Wind with a Bonus Action, you can move up to half your Speed without provoking Opportunity Attacks."
    ],
    "url": "/api/2024/features/tactical-shift"
  },
  {
    "index": "ability-score-improvement-fighter-6",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Ability Score Improvement",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-fighter-6"
  },
  {
    "index": "ability-score-improvement-fighter-8",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Ability Score Improvement",
    "level": 8,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-fighter-8"
  },
  {
    "index": "indomitable",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Indomitable",
    "level": 9,
    "prerequisites": [],
    "desc": [
      "If you fail a saving throw, you can reroll it with a bonus equal to your Fighter level. You must use the new roll, and you can't use this feature again until you finish a Long Rest.",
      "You can use this feature twice before a Long Rest starting at level 13 and three times before a Long Rest starting at level 17."
    ],
    "url": "/api/2024/features/indomitable"
  },
  {
    "index": "tactical-master",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Tactical Master",
    "level": 9,
    "prerequisites": [],
    "desc": [
      "When you attack with a weapon whose mastery property you can use, you can replace that property with the Push, Sap, or Slow property for that attack."
    ],
    "url": "/api/2024/features/tactical-master"
  },
  {
    "index": "two-extra-attacks",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Two Extra Attacks",
    "level": 11,
    "prerequisites": [],
    "desc": [
      "You can attack three times instead of once whenever you take the Attack action on your turn."
    ],
    "url": "/api/2024/features/two-extra-attacks"
  },
  {
    "index": "ability-score-improvement-fighter-12",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Ability Score Improvement",
    "level": 12,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-fighter-12"
  },
  {
    "index": "studied-attacks",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Studied Attacks",
    "level": 13,
    "prerequisites": [],
    "desc": [
      "You study your opponents and learn from each attack you make. If you make an attack roll against a creature and miss, you have Advantage on your next attack roll against that creature before the end of your next turn."
    ],
    "url": "/api/2024/features/studied-attacks"
  },
  {
    "index": "ability-score-improvement-fighter-14",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Ability Score Improvement",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-fighter-14"
  },
  {
    "index": "ability-score-improvement-fighter-16",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Ability Score Improvement",
    "level": 16,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-fighter-16"
  },
  {
    "index": "epic-boon-fighter",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see \"Feats\") or another feat of your choice for which you qualify. Boon of Combat Prowess is recommended."
    ],
    "url": "/api/2024/features/epic-boon-fighter"
  },
  {
    "index": "three-extra-attacks",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "name": "Three Extra Attacks",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "You can attack four times instead of once whenever you take the Attack action on your turn."
    ],
    "url": "/api/2024/features/three-extra-attacks"
  },
  {
    "index": "martial-arts",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Martial Arts",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Your practice of martial arts gives you mastery of combat styles that use your Unarmed Strike and Monk weapons, which are the following:",
      "• Simple Melee weapons",
      "• Martial Melee weapons that have the Light property",
      "You gain the following benefits while you are unarmed or wielding only Monk weapons and you aren't wearing armor or wielding a Shield.",
      "Bonus Unarmed Strike. You can make an Unarmed Strike as a Bonus Action.",
      "Martial Arts Die. You can roll 1d6 in place of the normal damage of your Unarmed Strike or Monk weapons. This die changes as you gain Monk levels, as shown in the Martial Arts column of the Monk Features table.",
      "Dexterous Attacks. You can use your Dexterity modifier instead of your Strength modifier for the attack and damage rolls of your Unarmed Strikes and Monk weapons. In addition, when you use the Grapple or Shove option of your Unarmed Strike, you can use your Dexterity modifier instead of your Strength modifier to determine the save DC."
    ],
    "url": "/api/2024/features/martial-arts"
  },
  {
    "index": "unarmored-defense-monk",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Unarmored Defense",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "While you aren't wearing armor or wielding a Shield, your base Armor Class equals 10 plus your Dexterity and Wisdom modifiers."
    ],
    "url": "/api/2024/features/unarmored-defense-monk"
  },
  {
    "index": "monks-focus",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Monk's Focus",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "Your focus and martial training allow you to harness a well of extraordinary energy within yourself. This energy is represented by Focus Points. Your Monk level determines the number of points you have, as shown in the Focus Points column of the Monk Features table.",
      "You can expend these points to enhance or fuel certain Monk features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind, each of which is detailed below.",
      "When you expend a Focus Point, it is unavailable until you finish a Short or Long Rest, at the end of which you regain all your expended points.",
      "Some features that use Focus Points require your target to make a saving throw. The save DC equals 8 plus your Wisdom modifier and Proficiency Bonus.",
      "Flurry of Blows. You can expend 1 Focus Point to make two Unarmed Strikes as a Bonus Action.",
      "Patient Defense. You can take the Disengage action as a Bonus Action. Alternatively, you can expend 1 Focus Point to take both the Disengage and the Dodge actions as a Bonus Action.",
      "Step of the Wind. You can take the Dash action as a Bonus Action. Alternatively, you can expend 1 Focus Point to take both the Disengage and Dash actions as a Bonus Action, and your jump distance is doubled for the turn."
    ],
    "url": "/api/2024/features/monks-focus"
  },
  {
    "index": "unarmored-movement",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Unarmored Movement",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "Your speed increases by 10 feet while you aren't wearing armor or wielding a Shield. This bonus increases when you reach certain Monk levels, as shown on the Monk Features table."
    ],
    "url": "/api/2024/features/unarmored-movement"
  },
  {
    "index": "uncanny-metabolism",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Uncanny Metabolism",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "When you roll Initiative, you can regain all expended Focus Points. When you do so, roll your Martial Arts die, and regain a number of Hit Points equal to your Monk level plus the number rolled.",
      "Once you use this feature, you can't use it again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/uncanny-metabolism"
  },
  {
    "index": "deflect-attacks",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Deflect Attacks",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "When an attack roll hits you and its damage includes Bludgeoning, Piercing, or Slashing damage, you can take a Reaction to reduce the attack's total damage against you. The reduction equals 1d10 plus your Dexterity modifier and Monk level.",
      "If you reduce the damage to 0, you can expend 1 Focus Point to redirect some of the attack's force. If you do so, choose a creature you can see within 5 feet of yourself if the attack was a melee attack or a creature you can see within 60 feet of yourself that isn't behind Total Cover if the attack was a ranged attack. That creature must succeed on a Dexterity saving throw or take damage equal to two rolls of your Martial Arts die plus your Dexterity modifier. The damage is the same type dealt by the attack."
    ],
    "url": "/api/2024/features/deflect-attacks"
  },
  {
    "index": "monk-subclass",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Monk Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Monk subclass of your choice. The Warrior of the Open Hand subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Monk levels. For the rest of your career, you gain each of your subclass's features that are of your Monk level or lower."
    ],
    "url": "/api/2024/features/monk-subclass"
  },
  {
    "index": "ability-score-improvement-monk-4",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Monk levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-monk-4"
  },
  {
    "index": "slow-fall",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Slow Fall",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You can take a Reaction when you fall to reduce any damage you take from the fall by an amount equal to five times your Monk level."
    ],
    "url": "/api/2024/features/slow-fall"
  },
  {
    "index": "extra-attack-monk",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Extra Attack",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "You can attack twice instead of once whenever you take the Attack action on your turn."
    ],
    "url": "/api/2024/features/extra-attack-monk"
  },
  {
    "index": "stunning-strike",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Stunning Strike",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "Once per turn when you hit a creature with a Monk weapon or an Unarmed Strike, you can expend 1 Focus Point to attempt a stunning strike. The target must make a Constitution saving throw. On a failed save, the target has the Stunned condition until the start of your next turn. On a successful save, the target's Speed is halved until the start of your next turn, and the next attack roll made against the target before then has Advantage."
    ],
    "url": "/api/2024/features/stunning-strike"
  },
  {
    "index": "empowered-strikes",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Empowered Strikes",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "Whenever you deal damage with your Unarmed Strike, it can deal your choice of Force damage or its normal damage type."
    ],
    "url": "/api/2024/features/empowered-strikes"
  },
  {
    "index": "evasion-monk",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Evasion",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "When you're subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw and only half damage if you fail.",
      "You don't benefit from this feature if you have the Incapacitated condition."
    ],
    "url": "/api/2024/features/evasion-monk"
  },
  {
    "index": "ability-score-improvement-monk-8",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Ability Score Improvement",
    "level": 8,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-monk-8"
  },
  {
    "index": "acrobatic-movement",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Acrobatic Movement",
    "level": 9,
    "prerequisites": [],
    "desc": [
      "While you aren't wearing armor or wielding a Shield, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the movement."
    ],
    "url": "/api/2024/features/acrobatic-movement"
  },
  {
    "index": "heightened-focus",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Heightened Focus",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "Your Flurry of Blows, Patient Defense, and Step of the Wind gain the following benefits.",
      "Flurry of Blows. You can expend 1 Focus Point to use Flurry of Blows and make three Unarmed Strikes with it instead of two.",
      "Patient Defense. When you expend a Focus Point to use Patient Defense, you gain a number of Temporary Hit Points equal to two rolls of your Martial Arts die.",
      "Step of the Wind. When you expend a Focus Point to use Step of the Wind, you can choose a willing creature within 5 feet of yourself that is Large or smaller. You move the creature with you until the end of your turn. The creature's movement doesn't provoke Opportunity Attacks."
    ],
    "url": "/api/2024/features/heightened-focus"
  },
  {
    "index": "self-restoration",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Self-Restoration",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "Through sheer force of will, you can remove one of the following conditions from yourself at the end of each of your turns: Charmed, Frightened, or Poisoned.",
      "In addition, forgoing food and drink doesn't give you levels of Exhaustion."
    ],
    "url": "/api/2024/features/self-restoration"
  },
  {
    "index": "ability-score-improvement-monk-12",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Ability Score Improvement",
    "level": 12,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-monk-12"
  },
  {
    "index": "deflect-energy",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Deflect Energy",
    "level": 13,
    "prerequisites": [],
    "desc": [
      "You can now use your Deflect Attacks feature against attacks that deal any damage type, not just Bludgeoning, Piercing, or Slashing."
    ],
    "url": "/api/2024/features/deflect-energy"
  },
  {
    "index": "disciplined-survivor",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Disciplined Survivor",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "Your physical and mental discipline grant you proficiency in all saving throws.",
      "Additionally, whenever you make a saving throw and fail, you can expend 1 Focus Point to reroll it, and you must use the new roll."
    ],
    "url": "/api/2024/features/disciplined-survivor"
  },
  {
    "index": "perfect-focus",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Perfect Focus",
    "level": 15,
    "prerequisites": [],
    "desc": [
      "When you roll Initiative and don't use Uncanny Metabolism, you regain expended Focus Points until you have 4 if you have 3 or fewer."
    ],
    "url": "/api/2024/features/perfect-focus"
  },
  {
    "index": "ability-score-improvement-monk-16",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Ability Score Improvement",
    "level": 16,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-monk-16"
  },
  {
    "index": "superior-defense",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Superior Defense",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "At the start of your turn, you can expend 3 Focus Points to bolster yourself against harm for 1 minute or until you have the Incapacitated condition. During that time, you have Resistance to all damage except Force damage."
    ],
    "url": "/api/2024/features/superior-defense"
  },
  {
    "index": "epic-boon-monk",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see \"Feats\") or another feat of your choice for which you qualify. Boon of Irresistible Offense is recommended."
    ],
    "url": "/api/2024/features/epic-boon-monk"
  },
  {
    "index": "body-and-mind",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "name": "Body and Mind",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "You have developed your body and mind to new heights. Your Dexterity and Wisdom scores increase by 4, to a maximum of 25."
    ],
    "url": "/api/2024/features/body-and-mind"
  },
  {
    "index": "lay-on-hands",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Lay on Hands",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Your blessed touch can heal wounds. You have a pool of healing power that replenishes when you finish a Long Rest. With that pool, you can restore a total number of Hit Points equal to five times your Paladin level.",
      "As an action, you can touch a creature and restore a number of Hit Points to that creature, up to the maximum amount remaining in your pool.",
      "You can also expend 5 Hit Points from the pool of healing power to remove the Poisoned condition from the creature; those points don't also restore Hit Points to the creature."
    ],
    "url": "/api/2024/features/lay-on-hands"
  },
  {
    "index": "spellcasting-paladin",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Spellcasting",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have learned to cast spells through prayer and meditation. See \"Spells\" for the rules on spellcasting. The information below details how you use those rules with Paladin spells, which appear in the Paladin spell list later in the class's description.",
      "Spell Slots. The Paladin Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended slots when you finish a Long Rest.",
      "Prepared Spells of Level 1+. You prepare the list of level 1+ spells that are available for you to cast with this feature. To start, choose two level 1 Paladin spells. Heroism and Searing Smite are recommended.",
      "The number of spells on your list increases as you gain Paladin levels, as shown in the Prepared Spells column of the Paladin Features table. Whenever that number increases, choose additional Paladin spells until the number of spells on your list matches the number in the Paladin Features table. The chosen spells must be of a level for which you have spell slots.",
      "If another Paladin feature gives you spells that you always have prepared, those spells don't count against the number of spells you can prepare with this feature, but those spells otherwise count as Paladin spells for you.",
      "Changing Your Prepared Spells. Whenever you finish a Long Rest, you can replace one spell on your list with another Paladin spell for which you have spell slots.",
      "Spellcasting Ability. Charisma is your spellcasting ability for your Paladin spells.",
      "Spellcasting Focus. You can use a Holy Symbol as a Spellcasting Focus for your Paladin spells."
    ],
    "url": "/api/2024/features/spellcasting-paladin"
  },
  {
    "index": "weapon-mastery-paladin",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Weapon Mastery",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Your training with weapons allows you to use the mastery properties of two kinds of weapons of your choice with which you have proficiency, such as Longswords and Javelins.",
      "Whenever you finish a Long Rest, you can change the kinds of weapons you chose. For example, you could switch to using the mastery properties of Halberds and Flails."
    ],
    "url": "/api/2024/features/weapon-mastery-paladin"
  },
  {
    "index": "fighting-style-paladin",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Fighting Style",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You gain a Fighting Style feat of your choice (see \"Feats\" for feats). Instead of choosing one of those feats, you can choose the option below.",
      "Blessed Warrior. You learn two Cleric cantrips of your choice (see the Cleric class's section for a list of Cleric spells). Guidance and Sacred Flame are recommended. The chosen cantrips count as Paladin spells for you, and Charisma is your spellcasting ability for them. Whenever you gain a Paladin level, you can replace one of these cantrips with another Cleric cantrip."
    ],
    "url": "/api/2024/features/fighting-style-paladin"
  },
  {
    "index": "paladins-smite",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Paladin's Smite",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You always have the Divine Smite spell prepared. In addition, you can cast it without expending a spell slot, but you must finish a Long Rest before you can cast it in this way again."
    ],
    "url": "/api/2024/features/paladins-smite"
  },
  {
    "index": "channel-divinity-paladin",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Channel Divinity",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You can channel divine energy directly from the Outer Planes, using it to fuel magical effects. You start with one such effect: Divine Sense, which is described below. Other Paladin features give additional Channel Divinity effect options. Each time you use this class's Channel Divinity, you choose which effect from this class to create.",
      "You can use this class's Channel Divinity twice. You regain one of its expended uses when you finish a Short Rest, and you regain all expended uses when you finish a Long Rest. You gain an additional use when you reach Paladin level 11.",
      "If a Channel Divinity effect requires a saving throw, the DC equals the spell save DC from this class's Spellcasting feature.",
      "Divine Sense. As a Bonus Action, you can open your awareness to detect Celestials, Fiends, and Undead. For the next 10 minutes or until you have the Incapacitated condition, you know the location of any creature of those types within 60 feet of yourself, and you know its creature type. Within the same radius, you also detect the presence of any place or object that has been consecrated or desecrated, as with the Hallow spell."
    ],
    "url": "/api/2024/features/channel-divinity-paladin"
  },
  {
    "index": "paladin-subclass",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Paladin Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Paladin subclass of your choice. The Oath of Devotion subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Paladin levels. For the rest of your career, you gain each of your subclass's features that are of your Paladin level or lower."
    ],
    "url": "/api/2024/features/paladin-subclass"
  },
  {
    "index": "ability-score-improvement-paladin-4",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Paladin levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-paladin-4"
  },
  {
    "index": "extra-attack-paladin",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Extra Attack",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "You can attack twice instead of once whenever you take the Attack action on your turn."
    ],
    "url": "/api/2024/features/extra-attack-paladin"
  },
  {
    "index": "faithful-steed",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Faithful Steed",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "You can call on the aid of an otherworldly steed. You always have the Find Steed spell prepared.",
      "You can also cast the spell once without expending a spell slot, and you regain the ability to do so when you finish a Long Rest."
    ],
    "url": "/api/2024/features/faithful-steed"
  },
  {
    "index": "aura-of-protection",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Aura of Protection",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You radiate a protective, unseeable aura in a 10-foot Emanation that originates from you. The aura is inactive while you have the Incapacitated condition.",
      "You and your allies in the aura gain a bonus to saving throws equal to your Charisma modifier (minimum bonus of +1).",
      "If another Paladin is present, a creature can benefit from only one Aura of Protection at a time; the creature chooses which aura while in them."
    ],
    "url": "/api/2024/features/aura-of-protection"
  },
  {
    "index": "ability-score-improvement-paladin-8",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Ability Score Improvement",
    "level": 8,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-paladin-8"
  },
  {
    "index": "abjure-foes",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Abjure Foes",
    "level": 9,
    "prerequisites": [],
    "desc": [
      "As a Magic action, you can expend one use of this class's Channel Divinity to overwhelm foes with awe. As you present your Holy Symbol or weapon, you can target a number of creatures equal to your Charisma modifier (minimum of one creature) that you can see within 60 feet of yourself. Each target must succeed on a Wisdom saving throw or have the Frightened condition for 1 minute or until it takes any damage. While Frightened in this way, a target can do only one of the following on its turns: move, take an action, or take a Bonus Action."
    ],
    "url": "/api/2024/features/abjure-foes"
  },
  {
    "index": "aura-of-courage",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Aura of Courage",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "You and your allies have Immunity to the Frightened condition while in your Aura of Protection. If a Frightened ally enters the aura, that condition has no effect on that ally while there."
    ],
    "url": "/api/2024/features/aura-of-courage"
  },
  {
    "index": "radiant-strikes",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Radiant Strikes",
    "level": 11,
    "prerequisites": [],
    "desc": [
      "Your strikes now carry supernatural power. When you hit a target with an attack roll using a Melee weapon or an Unarmed Strike, the target takes an extra 1d8 Radiant damage."
    ],
    "url": "/api/2024/features/radiant-strikes"
  },
  {
    "index": "ability-score-improvement-paladin-12",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Ability Score Improvement",
    "level": 12,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-paladin-12"
  },
  {
    "index": "restoring-touch",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Restoring Touch",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "When you use Lay On Hands on a creature, you can also remove one or more of the following conditions from the creature: Blinded, Charmed, Deafened, Frightened, Paralyzed, or Stunned. You must expend 5 Hit Points from the healing pool of Lay On Hands for each of these conditions you remove; those points don't also restore Hit Points to the creature."
    ],
    "url": "/api/2024/features/restoring-touch"
  },
  {
    "index": "ability-score-improvement-paladin-16",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Ability Score Improvement",
    "level": 16,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-paladin-16"
  },
  {
    "index": "aura-expansion",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Aura Expansion",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "Your Aura of Protection is now a 30-foot Emanation."
    ],
    "url": "/api/2024/features/aura-expansion"
  },
  {
    "index": "epic-boon-paladin",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see \"Feats\") or another feat of your choice for which you qualify. Boon of Truesight is recommended."
    ],
    "url": "/api/2024/features/epic-boon-paladin"
  },
  {
    "index": "holy-nimbus",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "name": "Holy Nimbus",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "As a Bonus Action, you can imbue your Aura of Protection with holy power, granting the benefits below for 10 minutes or until you end them (no action required). Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required).",
      "Holy Ward. You have Advantage on any saving throw you are forced to make by a Fiend or an Undead.",
      "Radiant Damage. Whenever an enemy starts its turn in the aura, that creature takes Radiant damage equal to your Charisma modifier plus your Proficiency Bonus.",
      "Sunlight. The aura is filled with Bright Light that is sunlight."
    ],
    "url": "/api/2024/features/holy-nimbus"
  },
  {
    "index": "spellcasting-ranger",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Spellcasting",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have learned to channel the magical essence of nature to cast spells. See \"Spells\" for the rules on spellcasting. The information below details how you use those rules with Ranger spells, which appear in the Ranger spell list later in the class's description.",
      "Spell Slots. The Ranger Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended slots when you finish a Long Rest.",
      "Prepared Spells of Level 1+. You prepare the list of level 1+ spells that are available for you to cast with this feature. To start, choose two level 1 Ranger spells. Cure Wounds and Hunter's Mark are recommended.",
      "The number of spells on your list increases as you gain Ranger levels, as shown in the Prepared Spells column of the Ranger Features table. Whenever that number increases, choose additional Ranger spells until the number of spells on your list matches the number in the Ranger Features table. The chosen spells must be of a level for which you have spell slots. For example, if you're a level 5 Ranger, your list of prepared spells can include six Ranger spells of level 1 or 2 in any combination.",
      "If another Ranger feature gives you spells that you always have prepared, those spells don't count against the number of spells you can prepare with this feature, but those spells otherwise count as Ranger spells for you.",
      "Changing Your Prepared Spells. Whenever you finish a Long Rest, you can replace one spell on your list with another Ranger spell for which you have spell slots.",
      "Spellcasting Ability. Wisdom is your spellcasting ability for your Ranger spells.",
      "Spellcasting Focus. You can use a Druidic Focus as a Spellcasting Focus for your Ranger spells."
    ],
    "url": "/api/2024/features/spellcasting-ranger"
  },
  {
    "index": "favored-enemy",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Favored Enemy",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You always have the Hunter's Mark spell prepared. You can cast it twice without expending a spell slot, and you regain all expended uses of this ability when you finish a Long Rest.",
      "The number of times you can cast the spell without a spell slot increases when you reach certain Ranger levels, as shown in the Favored Enemy column of the Ranger Features table."
    ],
    "url": "/api/2024/features/favored-enemy"
  },
  {
    "index": "weapon-mastery-ranger",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Weapon Mastery",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Your training with weapons allows you to use the mastery properties of two kinds of weapons of your choice with which you have proficiency, such as Longbows and Shortswords.",
      "Whenever you finish a Long Rest, you can change the kinds of weapons you chose. For example, you could switch to using the mastery properties of Scimitars and Longswords."
    ],
    "url": "/api/2024/features/weapon-mastery-ranger"
  },
  {
    "index": "deft-explorer",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Deft Explorer",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "Thanks to your travels, you gain the following benefits.",
      "Expertise. Choose one of your skill proficiencies with which you lack Expertise. You gain Expertise in that skill.",
      "Languages. You know two languages of your choice from the language tables in \"Character Creation.\""
    ],
    "url": "/api/2024/features/deft-explorer"
  },
  {
    "index": "fighting-style-ranger",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Fighting Style",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You gain a Fighting Style feat of your choice (see \"Feats\"). Instead of choosing one of those feats, you can choose the option below.",
      "Druidic Warrior. You learn two Druid cantrips of your choice (see the Druid class's section for a list of Druid spells). Guidance and Starry Wisp are recommended. The chosen cantrips count as Ranger spells for you, and Wisdom is your spellcasting ability for them. Whenever you gain a Ranger level, you can replace one of these cantrips with another Druid cantrip."
    ],
    "url": "/api/2024/features/fighting-style-ranger"
  },
  {
    "index": "ranger-subclass",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Ranger Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Ranger subclass of your choice. The Hunter subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Ranger levels. For the rest of your career, you gain each of your subclass's features that are of your Ranger level or lower."
    ],
    "url": "/api/2024/features/ranger-subclass"
  },
  {
    "index": "ability-score-improvement-ranger-4",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Ranger levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-ranger-4"
  },
  {
    "index": "extra-attack-ranger",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Extra Attack",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "You can attack twice instead of once whenever you take the Attack action on your turn."
    ],
    "url": "/api/2024/features/extra-attack-ranger"
  },
  {
    "index": "roving",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Roving",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "Your Speed increases by 10 feet while you aren't wearing Heavy armor. You also have a Climb Speed and a Swim Speed equal to your Speed."
    ],
    "url": "/api/2024/features/roving"
  },
  {
    "index": "ability-score-improvement-ranger-8",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Ability Score Improvement",
    "level": 8,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Ranger levels 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-ranger-8"
  },
  {
    "index": "expertise-ranger",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Expertise",
    "level": 9,
    "prerequisites": [],
    "desc": [
      "Choose two of your skill proficiencies with which you lack Expertise. You gain Expertise in those skills."
    ],
    "url": "/api/2024/features/expertise-ranger"
  },
  {
    "index": "tireless",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Tireless",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "Primal forces now help fuel you on your journeys, granting you the following benefits.",
      "Temporary Hit Points. As a Magic action, you can give yourself a number of Temporary Hit Points equal to 1d8 plus your Wisdom modifier (minimum of 1). You can use this action a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest.",
      "Decrease Exhaustion. Whenever you finish a Short Rest, your Exhaustion level, if any, decreases by 1."
    ],
    "url": "/api/2024/features/tireless"
  },
  {
    "index": "ability-score-improvement-ranger-12",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Ability Score Improvement",
    "level": 12,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify. You gain this feature again at Ranger level 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-ranger-12"
  },
  {
    "index": "relentless-hunter",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Relentless Hunter",
    "level": 13,
    "prerequisites": [],
    "desc": [
      "Taking damage can't break your Concentration on Hunter's Mark."
    ],
    "url": "/api/2024/features/relentless-hunter"
  },
  {
    "index": "natures-veil",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Nature's Veil",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "You invoke spirits of nature to magically hide yourself. As a Bonus Action, you can give yourself the Invisible condition until the end of your next turn.",
      "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest."
    ],
    "url": "/api/2024/features/natures-veil"
  },
  {
    "index": "ability-score-improvement-ranger-16",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Ability Score Improvement",
    "level": 16,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see \"Feats\") or another feat of your choice for which you qualify."
    ],
    "url": "/api/2024/features/ability-score-improvement-ranger-16"
  },
  {
    "index": "precise-hunter",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Precise Hunter",
    "level": 17,
    "prerequisites": [],
    "desc": [
      "You have Advantage on attack rolls against the creature currently marked by your Hunter's Mark."
    ],
    "url": "/api/2024/features/precise-hunter"
  },
  {
    "index": "feral-senses",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Feral Senses",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "Your connection to the forces of nature grants you Blindsight with a range of 30 feet."
    ],
    "url": "/api/2024/features/feral-senses"
  },
  {
    "index": "epic-boon-ranger",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see \"Feats\") or another feat of your choice for which you qualify. Boon of Dimensional Travel is recommended."
    ],
    "url": "/api/2024/features/epic-boon-ranger"
  },
  {
    "index": "foe-slayer",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "name": "Foe Slayer",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "The damage die of your Hunter's Mark is a d10 rather than a d6."
    ],
    "url": "/api/2024/features/foe-slayer"
  },
  {
    "index": "expertise-rogue",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Expertise",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You gain Expertise in two of your skill proficiencies of your choice. Sleight of Hand and Stealth are recommended if you have proficiency in them.",
      "At Rogue level 6, you gain Expertise in two more of your skill proficiencies of your choice."
    ],
    "url": "/api/2024/features/expertise-rogue"
  },
  {
    "index": "sneak-attack",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Sneak Attack",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You know how to strike subtly and exploit a foe's distraction. Once per turn, you can deal an extra 1d6 damage to one creature you hit with an attack roll if you have Advantage on the roll and the attack uses a Finesse or a Ranged weapon. The extra damage's type is the same as the weapon's type.",
      "You don't need Advantage on the attack roll if at least one of your allies is within 5 feet of the target, the ally doesn't have the Incapacitated condition, and you don't have Disadvantage on the attack roll.",
      "The extra damage increases as you gain Rogue levels, as shown in the Sneak Attack column of the Rogue Features table."
    ],
    "url": "/api/2024/features/sneak-attack"
  },
  {
    "index": "thieves-cant",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Thieves' Cant",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You picked up various languages in the communities where you plied your roguish talents. You know Thieves' Cant and one other language of your choice, which you choose from the language tables in 'Character Creation.'"
    ],
    "url": "/api/2024/features/thieves-cant"
  },
  {
    "index": "weapon-mastery-rogue",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Weapon Mastery",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Your training with weapons allows you to use the mastery properties of two kinds of weapons of your choice with which you have proficiency, such as Daggers and Shortbows.",
      "Whenever you finish a Long Rest, you can change the kinds of weapons you chose. For example, you could switch to using the mastery properties of Scimitars and Shortswords."
    ],
    "url": "/api/2024/features/weapon-mastery-rogue"
  },
  {
    "index": "cunning-action",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Cunning Action",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "Your quick thinking and agility allow you to move and act quickly. On your turn, you can take one of the following actions as a Bonus Action: Dash, Disengage, or Hide."
    ],
    "url": "/api/2024/features/cunning-action"
  },
  {
    "index": "rogue-subclass",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Rogue Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Rogue subclass of your choice. The Thief subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Rogue levels. For the rest of your career, you gain each of your subclass's features that are of your Rogue level or lower."
    ],
    "url": "/api/2024/features/rogue-subclass"
  },
  {
    "index": "steady-aim",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Steady Aim",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "As a Bonus Action, you give yourself Advantage on your next attack roll on the current turn. You can use this feature only if you haven't moved during this turn, and after you use it, your Speed is 0 until the end of the current turn."
    ],
    "url": "/api/2024/features/steady-aim"
  },
  {
    "index": "ability-score-improvement-rogue",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see 'Feats') or another feat of your choice for which you qualify. You gain this feature again at Rogue levels 8, 10, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-rogue"
  },
  {
    "index": "cunning-strike",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Cunning Strike",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "You've developed cunning ways to use your Sneak Attack. When you deal Sneak Attack damage, you can add one of the following Cunning Strike effects. Each effect has a die cost, which is the number of Sneak Attack damage dice you must forgo to add the effect. You remove the die before rolling, and the effect occurs immediately after the attack's damage is dealt.",
      "If a Cunning Strike effect requires a saving throw, the DC equals 8 plus your Dexterity modifier and Proficiency Bonus.",
      "Poison (Cost: 1d6). You add a toxin to your strike, forcing the target to make a Constitution saving throw. On a failed save, the target has the Poisoned condition for 1 minute. At the end of each of its turns, the Poisoned target repeats the save, ending the effect on itself on a success. To use this effect, you must have a Poisoner's Kit on your person.",
      "Trip (Cost: 1d6). If the target is Large or smaller, it must succeed on a Dexterity saving throw or have the Prone condition.",
      "Withdraw (Cost: 1d6). Immediately after the attack, you move up to half your Speed without provoking Opportunity Attacks."
    ],
    "url": "/api/2024/features/cunning-strike"
  },
  {
    "index": "uncanny-dodge",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Uncanny Dodge",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "When an attacker that you can see hits you with an attack roll, you can take a Reaction to halve the attack's damage against you (round down)."
    ],
    "url": "/api/2024/features/uncanny-dodge"
  },
  {
    "index": "expertise-rogue-6",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Expertise",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You gain Expertise in two more of your skill proficiencies of your choice."
    ],
    "url": "/api/2024/features/expertise-rogue-6"
  },
  {
    "index": "evasion-rogue",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Evasion",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "You can nimbly dodge out of the way of certain dangers. When you're subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw and only half damage if you fail. You can't use this feature if you have the Incapacitated condition."
    ],
    "url": "/api/2024/features/evasion-rogue"
  },
  {
    "index": "reliable-talent",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Reliable Talent",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "Whenever you make an ability check that uses one of your skill or tool proficiencies, you can treat a d20 roll of 9 or lower as a 10."
    ],
    "url": "/api/2024/features/reliable-talent"
  },
  {
    "index": "improved-cunning-strike",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Improved Cunning Strike",
    "level": 11,
    "prerequisites": [],
    "desc": [
      "You can use up to two Cunning Strike effects when you deal Sneak Attack damage, paying the die cost for each effect."
    ],
    "url": "/api/2024/features/improved-cunning-strike"
  },
  {
    "index": "devious-strikes",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Devious Strikes",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "You've practiced new ways to use your Sneak Attack deviously. The following effects are now among your Cunning Strike options.",
      "Daze (Cost: 2d6). The target must succeed on a Constitution saving throw, or on its next turn, it can do only one of the following: move or take an action or a Bonus Action.",
      "Knock Out (Cost: 6d6). The target must succeed on a Constitution saving throw, or it has the Unconscious condition for 1 minute or until it takes any damage. The Unconscious target repeats the save at the end of each of its turns, ending the effect on itself on a success.",
      "Obscure (Cost: 3d6). The target must succeed on a Dexterity saving throw, or it has the Blinded condition until the end of its next turn."
    ],
    "url": "/api/2024/features/devious-strikes"
  },
  {
    "index": "slippery-mind",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Slippery Mind",
    "level": 15,
    "prerequisites": [],
    "desc": [
      "Your cunning mind is exceptionally difficult to control. You gain proficiency in Wisdom and Charisma saving throws."
    ],
    "url": "/api/2024/features/slippery-mind"
  },
  {
    "index": "elusive",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Elusive",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "You're so evasive that attackers rarely gain the upper hand against you. No attack roll can have Advantage against you unless you have the Incapacitated condition."
    ],
    "url": "/api/2024/features/elusive"
  },
  {
    "index": "epic-boon-rogue",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see 'Feats') or another feat of your choice for which you qualify. Boon of the Night Spirit is recommended."
    ],
    "url": "/api/2024/features/epic-boon-rogue"
  },
  {
    "index": "stroke-of-luck",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "name": "Stroke of Luck",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "You have a marvelous knack for succeeding when you need to. If you fail a D20 Test, you can turn the roll into a 20.",
      "Once you use this feature, you can't use it again until you finish a Short or Long Rest."
    ],
    "url": "/api/2024/features/stroke-of-luck"
  },
  {
    "index": "spellcasting-sorcerer",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Spellcasting",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Drawing from your innate magic, you can cast spells. See 'Spells' for the rules on spellcasting. The information below details how you use those rules with Sorcerer spells, which appear in the Sorcerer spell list later in the class's description.",
      "Cantrips. You know four Sorcerer cantrips of your choice. Light, Prestidigitation, Shocking Grasp, and Sorcerous Burst are recommended. Whenever you gain a Sorcerer level, you can replace one of your cantrips from this feature with another Sorcerer cantrip of your choice. When you reach Sorcerer levels 4 and 10, you learn another Sorcerer cantrip of your choice, as shown in the Cantrips column of the Sorcerer Features table.",
      "Spell Slots. The Sorcerer Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended slots when you finish a Long Rest.",
      "Prepared Spells of Level 1+. You prepare the list of level 1+ spells that are available for you to cast with this feature. To start, choose two level 1 Sorcerer spells. Burning Hands and Detect Magic are recommended. The number of spells on your list increases as you gain Sorcerer levels, as shown in the Prepared Spells column of the Sorcerer Features table.",
      "Spellcasting Ability. Charisma is your spellcasting ability for your Sorcerer spells.",
      "Spellcasting Focus. You can use an Arcane Focus as a Spellcasting Focus for your Sorcerer spells."
    ],
    "url": "/api/2024/features/spellcasting-sorcerer"
  },
  {
    "index": "innate-sorcery",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Innate Sorcery",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "An event in your past left an indelible mark on you, infusing you with simmering magic. As a Bonus Action, you can unleash that magic for 1 minute, during which you gain the following benefits:",
      "• The spell save DC of your Sorcerer spells increases by 1.",
      "• You have Advantage on the attack rolls of Sorcerer spells you cast.",
      "You can use this feature twice, and you regain all expended uses of it when you finish a Long Rest."
    ],
    "url": "/api/2024/features/innate-sorcery"
  },
  {
    "index": "font-of-magic",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Font of Magic",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You can tap into the wellspring of magic within yourself. This wellspring is represented by Sorcery Points, which allow you to create a variety of magical effects. You have 2 Sorcery Points, and you gain more as you reach higher levels, as shown in the Sorcery Points column of the Sorcerer Features table.",
      "You can use your Sorcery Points to fuel the options below, along with other features, such as Metamagic, that use those points.",
      "Converting Spell Slots to Sorcery Points. You can expend a spell slot to gain a number of Sorcery Points equal to the slot's level (no action required).",
      "Creating Spell Slots. As a Bonus Action, you can transform unexpended Sorcery Points into one spell slot. You can create a spell slot no higher than level 5. Any spell slot you create with this feature vanishes when you finish a Long Rest."
    ],
    "url": "/api/2024/features/font-of-magic"
  },
  {
    "index": "metamagic",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Metamagic",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "Because your magic flows from within, you can alter your spells to suit your needs; you gain two Metamagic options of your choice from 'Metamagic Options' later in this class's description. You use the chosen options to temporarily modify spells you cast.",
      "You can use only one Metamagic option on a spell when you cast it unless otherwise noted in one of those options.",
      "Whenever you gain a Sorcerer level, you can replace one of your Metamagic options with one you don't know. You gain two more options at Sorcerer level 10 and two more at Sorcerer level 17."
    ],
    "url": "/api/2024/features/metamagic"
  },
  {
    "index": "careful-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Careful Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 1 Sorcery Point",
      "When you cast a spell that forces other creatures to make a saving throw, you can protect some of those creatures from the spell's full force. To do so, spend 1 Sorcery Point and choose a number of those creatures up to your Charisma modifier (minimum of one creature). A chosen creature automatically succeeds on its saving throw against the spell, and it takes no damage if it would normally take half damage on a successful save."
    ],
    "url": "/api/2024/features/careful-spell"
  },
  {
    "index": "distant-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Distant Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 1 Sorcery Point",
      "When you cast a spell that has a range of at least 5 feet, you can spend 1 Sorcery Point to double the spell's range. Or when you cast a spell that has a range of Touch, you can spend 1 Sorcery Point to make the spell's range 30 feet."
    ],
    "url": "/api/2024/features/distant-spell"
  },
  {
    "index": "empowered-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Empowered Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 1 Sorcery Point",
      "When you roll damage for a spell, you can spend 1 Sorcery Point to reroll a number of the damage dice up to your Charisma modifier (minimum of one), and you must use the new rolls.",
      "You can use Empowered Spell even if you've already used a different Metamagic option during the casting of the spell."
    ],
    "url": "/api/2024/features/empowered-spell"
  },
  {
    "index": "extended-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Extended Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 1 Sorcery Point",
      "When you cast a spell that has a duration of 1 minute or longer, you can spend 1 Sorcery Point to double its duration to a maximum duration of 24 hours. If the affected spell requires Concentration, you have Advantage on any saving throw you make to maintain that Concentration."
    ],
    "url": "/api/2024/features/extended-spell"
  },
  {
    "index": "heightened-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Heightened Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 2 Sorcery Points",
      "When you cast a spell that forces a creature to make a saving throw, you can spend 2 Sorcery Points to give one target of the spell Disadvantage on saves against the spell."
    ],
    "url": "/api/2024/features/heightened-spell"
  },
  {
    "index": "quickened-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Quickened Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 1 Sorcery Point",
      "When you cast a spell that has a casting time of an action, you can spend 1 Sorcery Point to change the casting time to a bonus action for this casting."
    ],
    "url": "/api/2024/features/quickened-spell"
  },
  {
    "index": "seeking-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Seeking Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 1 Sorcery Point",
      "If you make an attack roll for a spell and miss, you can spend 1 Sorcery Point to reroll the d20, and you must use the new roll.",
      "You can use Seeking Spell even if you've already used a different Metamagic option during the casting of the spell."
    ],
    "url": "/api/2024/features/seeking-spell"
  },
  {
    "index": "subtle-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Subtle Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 1 Sorcery Point",
      "When you cast a spell, you can spend 1 Sorcery Point to cast it without any Verbal, Somatic, or Material components, except Material components that are consumed by the spell or that have a cost specified in the spell."
    ],
    "url": "/api/2024/features/subtle-spell"
  },
  {
    "index": "transmuted-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Transmuted Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 1 Sorcery Point",
      "When you cast a spell that deals a type of damage from the following list, you can spend 1 Sorcery Point to change that damage type to one of the other listed types: Acid, Cold, Fire, Lightning, Poison, Thunder."
    ],
    "url": "/api/2024/features/transmuted-spell"
  },
  {
    "index": "twinned-spell",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Twinned Spell",
    "level": 2,
    "prerequisites": [
      "Metamagic feature"
    ],
    "desc": [
      "Cost: 1 Sorcery Point",
      "When you cast a spell, such as Charm Person, that can be cast with a higher-level spell slot to target an additional creature, you can spend 1 Sorcery Point to increase the spell's effective level by 1."
    ],
    "url": "/api/2024/features/twinned-spell"
  },
  {
    "index": "sorcerer-subclass",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Sorcerer Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Sorcerer subclass of your choice. The Draconic Sorcery subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Sorcerer levels. For the rest of your career, you gain each of your subclass's features that are of your Sorcerer level or lower."
    ],
    "url": "/api/2024/features/sorcerer-subclass"
  },
  {
    "index": "ability-score-improvement-sorcerer",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see 'Feats') or another feat of your choice for which you qualify. You gain this feature again at Sorcerer levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-sorcerer"
  },
  {
    "index": "sorcerous-restoration",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Sorcerous Restoration",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "When you finish a Short Rest, you can regain expended Sorcery Points, but no more than a number equal to half your Sorcerer level (round down). Once you use this feature, you can't do so again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/sorcerous-restoration"
  },
  {
    "index": "sorcery-incarnate",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Sorcery Incarnate",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "If you have no uses of Innate Sorcery left, you can use it if you spend 2 Sorcery Points when you take the Bonus Action to activate it.",
      "In addition, while your Innate Sorcery feature is active, you can use up to two of your Metamagic options on each spell you cast."
    ],
    "url": "/api/2024/features/sorcery-incarnate"
  },
  {
    "index": "metamagic-sorcerer-10",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Metamagic",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "You gain two more Metamagic options of your choice."
    ],
    "url": "/api/2024/features/metamagic-sorcerer-10"
  },
  {
    "index": "metamagic-sorcerer-17",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Metamagic",
    "level": 17,
    "prerequisites": [],
    "desc": [
      "You gain two more Metamagic options of your choice."
    ],
    "url": "/api/2024/features/metamagic-sorcerer-17"
  },
  {
    "index": "epic-boon-sorcerer",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see 'Feats') or another feat of your choice for which you qualify. Boon of Dimensional Travel is recommended."
    ],
    "url": "/api/2024/features/epic-boon-sorcerer"
  },
  {
    "index": "arcane-apotheosis",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "name": "Arcane Apotheosis",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "While your Innate Sorcery feature is active, you can use one Metamagic option on each of your turns without spending Sorcery Points on it."
    ],
    "url": "/api/2024/features/arcane-apotheosis"
  },
  {
    "index": "eldritch-invocations",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Eldritch Invocations",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have unearthed Eldritch Invocations, pieces of forbidden knowledge that imbue you with an abiding magical ability or other lessons. You gain one invocation of your choice, such as Pact of the Tome. Invocations are described in the 'Eldritch Invocation Options' section later in this class's description.",
      "Prerequisites. If an invocation has a prerequisite, you must meet it to learn that invocation.",
      "Replacing and Gaining Invocations. Whenever you gain a Warlock level, you can replace one of your invocations with another one for which you qualify. You can't replace an invocation if it's a prerequisite for another invocation that you have.",
      "When you gain certain Warlock levels, you gain more invocations of your choice, as shown in the Invocations column of the Warlock Features table."
    ],
    "url": "/api/2024/features/eldritch-invocations"
  },
  {
    "index": "agonizing-blast",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Agonizing Blast",
    "level": 2,
    "prerequisites": [
      "Level 2+ Warlock",
      "a Warlock Cantrip That Deals Damage"
    ],
    "desc": [
      "Choose one of your known Warlock cantrips that deals damage. You can add your Charisma modifier to that spell's damage rolls.",
      "Repeatable. You can gain this invocation more than once. Each time you do so, choose a different eligible cantrip."
    ],
    "url": "/api/2024/features/agonizing-blast"
  },
  {
    "index": "armor-of-shadows",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Armor of Shadows",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You can cast Mage Armor on yourself without expending a spell slot."
    ],
    "url": "/api/2024/features/armor-of-shadows"
  },
  {
    "index": "ascendant-step",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Ascendant Step",
    "level": 5,
    "prerequisites": [
      "Level 5+ Warlock"
    ],
    "desc": [
      "You can cast Levitate on yourself without expending a spell slot."
    ],
    "url": "/api/2024/features/ascendant-step"
  },
  {
    "index": "devils-sight",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Devil's Sight",
    "level": 2,
    "prerequisites": [
      "Level 2+ Warlock"
    ],
    "desc": [
      "You can see normally in Dim Light and Darkness—both magical and nonmagical—within 120 feet of yourself."
    ],
    "url": "/api/2024/features/devils-sight"
  },
  {
    "index": "devouring-blade",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Devouring Blade",
    "level": 12,
    "prerequisites": [
      "Level 12+ Warlock",
      "Thirsting Blade Invocation"
    ],
    "desc": [
      "The Extra Attack of your Thirsting Blade invocation confers two extra attacks rather than one."
    ],
    "url": "/api/2024/features/devouring-blade"
  },
  {
    "index": "eldritch-mind",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Eldritch Mind",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Advantage on Constitution saving throws that you make to maintain Concentration."
    ],
    "url": "/api/2024/features/eldritch-mind"
  },
  {
    "index": "eldritch-smite",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Eldritch Smite",
    "level": 5,
    "prerequisites": [
      "Level 5+ Warlock",
      "Pact of the Blade Invocation"
    ],
    "desc": [
      "Once per turn when you hit a creature with your pact weapon, you can expend a Pact Magic spell slot to deal an extra 1d8 Force damage to the target, plus another 1d8 per level of the spell slot, and you can give the target the Prone condition if it is Huge or smaller."
    ],
    "url": "/api/2024/features/eldritch-smite"
  },
  {
    "index": "eldritch-spear",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Eldritch Spear",
    "level": 2,
    "prerequisites": [
      "Level 2+ Warlock",
      "a Warlock Cantrip That Deals Damage"
    ],
    "desc": [
      "Choose one of your known Warlock cantrips that deals damage and has a range of 10+ feet. When you cast that spell, its range increases by a number of feet equal to 30 times your Warlock level.",
      "Repeatable. You can gain this invocation more than once. Each time you do so, choose a different eligible cantrip."
    ],
    "url": "/api/2024/features/eldritch-spear"
  },
  {
    "index": "fiendish-vigor",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Fiendish Vigor",
    "level": 2,
    "prerequisites": [
      "Level 2+ Warlock"
    ],
    "desc": [
      "You can cast False Life on yourself without expending a spell slot. When you cast the spell with this feature, you don't roll the die for the Temporary Hit Points; you automatically get the highest number on the die."
    ],
    "url": "/api/2024/features/fiendish-vigor"
  },
  {
    "index": "gaze-of-two-minds",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Gaze of Two Minds",
    "level": 5,
    "prerequisites": [
      "Level 5+ Warlock"
    ],
    "desc": [
      "You can use a Bonus Action to touch a willing creature and perceive through its senses until the end of your next turn. As long as the creature is on the same plane of existence as you, you can take a Bonus Action on subsequent turns to maintain this connection, extending the duration until the end of your next turn. The connection ends if you don't maintain it in this way.",
      "While perceiving through the other creature's senses, you benefit from any special senses possessed by that creature, and you can cast spells as if you were in your space or the other creature's space if the two of you are within 60 feet of each other."
    ],
    "url": "/api/2024/features/gaze-of-two-minds"
  },
  {
    "index": "gift-of-the-depths",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Gift of the Depths",
    "level": 5,
    "prerequisites": [
      "Level 5+ Warlock"
    ],
    "desc": [
      "You can breathe underwater, and you gain a Swim Speed equal to your Speed.",
      "You can also cast Water Breathing once without expending a spell slot. You regain the ability to cast it in this way again when you finish a Long Rest."
    ],
    "url": "/api/2024/features/gift-of-the-depths"
  },
  {
    "index": "gift-of-the-protectors",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Gift of the Protectors",
    "level": 9,
    "prerequisites": [
      "Level 9+ Warlock",
      "Pact of the Tome Invocation"
    ],
    "desc": [
      "A new page appears in your Book of Shadows when you conjure it. With your permission, a creature can take an action to write its name on that page, which can contain a number of names equal to your Charisma modifier (minimum of one name).",
      "When any creature whose name is on the page is reduced to 0 Hit Points but not killed outright, the creature magically drops to 1 Hit Point instead. Once this magic is triggered, no creature can benefit from it until you finish a Long Rest.",
      "As a Magic action, you can erase a name on the page by touching it."
    ],
    "url": "/api/2024/features/gift-of-the-protectors"
  },
  {
    "index": "investment-of-the-chain-master",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Investment of the Chain Master",
    "level": 5,
    "prerequisites": [
      "Level 5+ Warlock",
      "Pact of the Chain Invocation"
    ],
    "desc": [
      "When you cast Find Familiar, you infuse the summoned familiar with a measure of your eldritch power, granting the creature the following benefits.",
      "Aerial or Aquatic. The familiar gains either a Fly Speed or a Swim Speed (your choice) of 40 feet.",
      "Quick Attack. As a Bonus Action, you can command the familiar to take the Attack action.",
      "Necrotic or Radiant Damage. Whenever the familiar deals Bludgeoning, Piercing, or Slashing damage, you can make it deal Necrotic or Radiant damage instead.",
      "Your Save DC. If the familiar forces a creature to make a saving throw, it uses your spell save DC.",
      "Resistance. When the familiar takes damage, you can take a Reaction to grant it Resistance against that damage."
    ],
    "url": "/api/2024/features/investment-of-the-chain-master"
  },
  {
    "index": "lessons-of-the-first-ones",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Lessons of the First Ones",
    "level": 2,
    "prerequisites": [
      "Level 2+ Warlock"
    ],
    "desc": [
      "You have received knowledge from an elder entity of the multiverse, allowing you to gain one Origin feat of your choice (see \"Feats\").",
      "Repeatable. You can gain this invocation more than once. Each time you do so, choose a different Origin feat."
    ],
    "url": "/api/2024/features/lessons-of-the-first-ones"
  },
  {
    "index": "lifedrinker",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Lifedrinker",
    "level": 9,
    "prerequisites": [
      "Level 9+ Warlock",
      "Pact of the Blade Invocation"
    ],
    "desc": [
      "Once per turn when you hit a creature with your pact weapon, you can deal an extra 1d6 Necrotic, Psychic, or Radiant damage (your choice) to the creature, and you can expend one of your Hit Point Dice to roll it and regain a number of Hit Points equal to the roll plus your Constitution modifier (minimum of 1 Hit Point)."
    ],
    "url": "/api/2024/features/lifedrinker"
  },
  {
    "index": "mask-of-many-faces",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Mask of Many Faces",
    "level": 2,
    "prerequisites": [
      "Level 2+ Warlock"
    ],
    "desc": [
      "You can cast Disguise Self without expending a spell slot."
    ],
    "url": "/api/2024/features/mask-of-many-faces"
  },
  {
    "index": "master-of-myriad-forms",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Master of Myriad Forms",
    "level": 5,
    "prerequisites": [
      "Level 5+ Warlock"
    ],
    "desc": [
      "You can cast Alter Self without expending a spell slot."
    ],
    "url": "/api/2024/features/master-of-myriad-forms"
  },
  {
    "index": "misty-visions",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Misty Visions",
    "level": 2,
    "prerequisites": [
      "Level 2+ Warlock"
    ],
    "desc": [
      "You can cast Silent Image without expending a spell slot."
    ],
    "url": "/api/2024/features/misty-visions"
  },
  {
    "index": "one-with-shadows",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "One with Shadows",
    "level": 5,
    "prerequisites": [
      "Level 5+ Warlock"
    ],
    "desc": [
      "While you're in an area of Dim Light or Darkness, you can cast Invisibility on yourself without expending a spell slot."
    ],
    "url": "/api/2024/features/one-with-shadows"
  },
  {
    "index": "otherworldly-leap",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Otherworldly Leap",
    "level": 2,
    "prerequisites": [
      "Level 2+ Warlock"
    ],
    "desc": [
      "You can cast Jump on yourself without expending a spell slot."
    ],
    "url": "/api/2024/features/otherworldly-leap"
  },
  {
    "index": "pact-of-the-blade",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Pact of the Blade",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "As a Bonus Action, you can conjure a pact weapon in your hand—a Simple or Martial Melee weapon of your choice with which you bond—or create a bond with a magic weapon you touch; you can't bond with a magic weapon if someone else is attuned to it or another Warlock is bonded with it. Until the bond ends, you have proficiency with the weapon, and you can use it as a Spellcasting Focus.",
      "Whenever you attack with the bonded weapon, you can use your Charisma modifier for the attack and damage rolls instead of using Strength or Dexterity; and you can cause the weapon to deal Necrotic, Psychic, or Radiant damage or its normal damage type.",
      "Your bond with the weapon ends if you use this feature's Bonus Action again, if the weapon is more than 5 feet away from you for 1 minute or more, or if you die. A conjured weapon disappears when the bond ends."
    ],
    "url": "/api/2024/features/pact-of-the-blade"
  },
  {
    "index": "pact-of-the-chain",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Pact of the Chain",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You learn the Find Familiar spell and can cast it as a Magic action without expending a spell slot.",
      "When you cast the spell, you choose one of the normal forms for your familiar or one of the following special forms: Imp, Pseudodragon, Quasit, Skeleton, Sphinx of Wonder, Sprite, or Venomous Snake (see \"Monsters\" for the familiar's stat block).",
      "Additionally, when you take the Attack action, you can forgo one of your own attacks to allow your familiar to make one attack of its own with its Reaction."
    ],
    "url": "/api/2024/features/pact-of-the-chain"
  },
  {
    "index": "pact-of-the-tome",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Pact of the Tome",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Stitching together strands of shadow, you conjure forth a book in your hand at the end of a Short or Long Rest. This Book of Shadows (you determine its appearance) contains eldritch magic that only you can access, granting you the benefits below. The book disappears if you conjure another book with this feature or if you die.",
      "Cantrips and Rituals. When the book appears, choose three cantrips, and choose two level 1 spells that have the Ritual tag. The spells can be from any class's spell list, and they must be spells you don't already have prepared. While the book is on your person, you have the chosen spells prepared, and they function as Warlock spells for you.",
      "Spellcasting Focus. You can use the book as a Spellcasting Focus."
    ],
    "url": "/api/2024/features/pact-of-the-tome"
  },
  {
    "index": "repelling-blast",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Repelling Blast",
    "level": 2,
    "prerequisites": [
      "Level 2+ Warlock",
      "a Warlock Cantrip That Deals Damage via an Attack Roll"
    ],
    "desc": [
      "Choose one of your known Warlock cantrips that requires an attack roll. When you hit a Large or smaller creature with that cantrip, you can push the creature up to 10 feet straight away from you.",
      "Repeatable. You can gain this invocation more than once. Each time you do so, choose a different eligible cantrip."
    ],
    "url": "/api/2024/features/repelling-blast"
  },
  {
    "index": "thirsting-blade",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Thirsting Blade",
    "level": 5,
    "prerequisites": [
      "Level 5+ Warlock",
      "Pact of the Blade Invocation"
    ],
    "desc": [
      "You gain the Extra Attack feature for your pact weapon only. With that feature, you can attack twice with the weapon instead of once when you take the Attack action on your turn."
    ],
    "url": "/api/2024/features/thirsting-blade"
  },
  {
    "index": "visions-of-distant-realms",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Visions of Distant Realms",
    "level": 9,
    "prerequisites": [
      "Level 9+ Warlock"
    ],
    "desc": [
      "You can cast Arcane Eye without expending a spell slot."
    ],
    "url": "/api/2024/features/visions-of-distant-realms"
  },
  {
    "index": "whispers-of-the-grave",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Whispers of the Grave",
    "level": 7,
    "prerequisites": [
      "Level 7+ Warlock"
    ],
    "desc": [
      "You can cast Speak with Dead without expending a spell slot."
    ],
    "url": "/api/2024/features/whispers-of-the-grave"
  },
  {
    "index": "witch-sight",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Witch Sight",
    "level": 15,
    "prerequisites": [
      "Level 15+ Warlock"
    ],
    "desc": [
      "You have Truesight with a range of 30 feet."
    ],
    "url": "/api/2024/features/witch-sight"
  },
  {
    "index": "pact-magic",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Pact Magic",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Through occult ceremony, you have formed a pact with a mysterious entity to gain magical powers. The entity is a voice in the shadows—its identity unclear—but its boon to you is concrete: the ability to cast spells. See 'Spells' for the rules on spellcasting.",
      "Cantrips. You know two Warlock cantrips of your choice. Eldritch Blast and Prestidigitation are recommended. Whenever you gain a Warlock level, you can replace one of your cantrips from this feature with another Warlock cantrip of your choice. When you reach Warlock levels 4 and 10, you learn another Warlock cantrip of your choice.",
      "Spell Slots. The Warlock Features table shows how many spell slots you have to cast your Warlock spells of levels 1–5. The table also shows the level of those slots, all of which are the same level. You regain all expended Pact Magic spell slots when you finish a Short or Long Rest.",
      "Prepared Spells of Level 1+. You prepare the list of level 1+ spells that are available for you to cast with this feature. To start, choose two level 1 Warlock spells. Charm Person and Hex are recommended.",
      "Spellcasting Ability. Charisma is the spellcasting ability for your Warlock spells.",
      "Spellcasting Focus. You can use an Arcane Focus as a Spellcasting Focus for your Warlock spells."
    ],
    "url": "/api/2024/features/pact-magic"
  },
  {
    "index": "magical-cunning",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Magical Cunning",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "You can perform an esoteric rite for 1 minute. At the end of it, you regain expended Pact Magic spell slots but no more than a number equal to half your maximum (round up). Once you use this feature, you can't do so again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/magical-cunning"
  },
  {
    "index": "warlock-subclass",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Warlock Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Warlock subclass of your choice. The Fiend Patron subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Warlock levels. For the rest of your career, you gain each of your subclass's features that are of your Warlock level or lower."
    ],
    "url": "/api/2024/features/warlock-subclass"
  },
  {
    "index": "ability-score-improvement-warlock",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see 'Feats') or another feat of your choice for which you qualify. You gain this feature again at Warlock levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-warlock"
  },
  {
    "index": "contact-patron",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Contact Patron",
    "level": 9,
    "prerequisites": [],
    "desc": [
      "In the past, you usually contacted your patron through intermediaries. Now you can communicate directly; you always have the Contact Other Plane spell prepared. With this feature, you can cast the spell without expending a spell slot to contact your patron, and you automatically succeed on the spell's saving throw.",
      "Once you cast the spell with this feature, you can't do so in this way again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/contact-patron"
  },
  {
    "index": "mystic-arcanum",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Mystic Arcanum",
    "level": 11,
    "prerequisites": [],
    "desc": [
      "Your patron grants you a magical secret called an arcanum. Choose one level 6 Warlock spell as this arcanum. You can cast your arcanum spell once without expending a spell slot, and you must finish a Long Rest before you can cast it in this way again.",
      "As shown in the Warlock Features table, you gain another Warlock spell of your choice that can be cast in this way when you reach Warlock levels 13 (level 7 spell), 15 (level 8 spell), and 17 (level 9 spell). You regain all uses of your Mystic Arcanum when you finish a Long Rest.",
      "Whenever you gain a Warlock level, you can replace one of your arcanum spells with another Warlock spell of the same level."
    ],
    "url": "/api/2024/features/mystic-arcanum"
  },
  {
    "index": "epic-boon-warlock",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see 'Feats') or another feat of your choice for which you qualify. Boon of Fate is recommended."
    ],
    "url": "/api/2024/features/epic-boon-warlock"
  },
  {
    "index": "eldritch-master",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "name": "Eldritch Master",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "When you use your Magical Cunning feature, you regain all your expended Pact Magic spell slots."
    ],
    "url": "/api/2024/features/eldritch-master"
  },
  {
    "index": "spellcasting-wizard",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Spellcasting",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "As a student of arcane magic, you have learned to cast spells. See 'Spells' for the rules on spellcasting. The information below details how you use those rules with Wizard spells, which appear in the Wizard spell list later in the class's description.",
      "Cantrips. You know three Wizard cantrips of your choice. Light, Mage Hand, and Ray of Frost are recommended. Whenever you finish a Long Rest, you can replace one of your cantrips from this feature with another Wizard cantrip of your choice. When you reach Wizard levels 4 and 10, you learn another Wizard cantrip of your choice.",
      "Spellbook. Your wizardly apprenticeship culminated in the creation of a unique book: your spellbook. It is a Tiny object that weighs 3 pounds, contains 100 pages, and can be read only by you or someone casting Identify. The book contains the level 1+ spells you know. It starts with six level 1 Wizard spells of your choice. Whenever you gain a Wizard level after 1, add two Wizard spells of your choice to your spellbook.",
      "Spell Slots. The Wizard Features table shows how many spell slots you have to cast your level 1+ spells. You regain all expended slots when you finish a Long Rest.",
      "Prepared Spells of Level 1+. You prepare the list of level 1+ spells that are available for you to cast with this feature. To do so, choose four spells from your spellbook. The chosen spells must be of a level for which you have spell slots.",
      "Spellcasting Ability. Intelligence is your spellcasting ability for your Wizard spells.",
      "Spellcasting Focus. You can use an Arcane Focus or your spellbook as a Spellcasting Focus for your Wizard spells."
    ],
    "url": "/api/2024/features/spellcasting-wizard"
  },
  {
    "index": "ritual-adept",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Ritual Adept",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You can cast any spell as a Ritual if that spell has the Ritual tag and the spell is in your spellbook. You needn't have the spell prepared, but you must read from the book to cast a spell in this way."
    ],
    "url": "/api/2024/features/ritual-adept"
  },
  {
    "index": "arcane-recovery",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Arcane Recovery",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You can regain some of your magical energy by studying your spellbook. When you finish a Short Rest, you can choose expended spell slots to recover. The spell slots can have a combined level equal to no more than half your Wizard level (round up), and none of the slots can be level 6 or higher.",
      "Once you use this feature, you can't do so again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/arcane-recovery"
  },
  {
    "index": "scholar",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Scholar",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "While studying magic, you also specialized in another field of study. Choose one of the following skills in which you have proficiency: Arcana, History, Investigation, Medicine, Nature, or Religion. You have Expertise in the chosen skill."
    ],
    "url": "/api/2024/features/scholar"
  },
  {
    "index": "wizard-subclass",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Wizard Subclass",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain a Wizard subclass of your choice. The Evoker subclass is detailed after this class's description. A subclass is a specialization that grants you features at certain Wizard levels. For the rest of your career, you gain each of your subclass's features that are of your Wizard level or lower."
    ],
    "url": "/api/2024/features/wizard-subclass"
  },
  {
    "index": "ability-score-improvement-wizard",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": [],
    "desc": [
      "You gain the Ability Score Improvement feat (see 'Feats') or another feat of your choice for which you qualify. You gain this feature again at Wizard levels 8, 12, and 16."
    ],
    "url": "/api/2024/features/ability-score-improvement-wizard"
  },
  {
    "index": "memorize-spell",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Memorize Spell",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "Whenever you finish a Short Rest, you can study your spellbook and replace one of the level 1+ Wizard spells you have prepared for your Spellcasting feature with another level 1+ spell from the book."
    ],
    "url": "/api/2024/features/memorize-spell"
  },
  {
    "index": "spell-mastery",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Spell Mastery",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "You have achieved such mastery over certain spells that you can cast them at will. Choose a level 1 and a level 2 spell in your spellbook that have a casting time of an action. You always have those spells prepared, and you can cast them at their lowest level without expending a spell slot. To cast either spell at a higher level, you must expend a spell slot.",
      "Whenever you finish a Long Rest, you can study your spellbook and replace one of those spells with an eligible spell of the same level from the book."
    ],
    "url": "/api/2024/features/spell-mastery"
  },
  {
    "index": "epic-boon-wizard",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Epic Boon",
    "level": 19,
    "prerequisites": [],
    "desc": [
      "You gain an Epic Boon feat (see 'Feats') or another feat of your choice for which you qualify. Boon of Spell Recall is recommended."
    ],
    "url": "/api/2024/features/epic-boon-wizard"
  },
  {
    "index": "signature-spells",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "name": "Signature Spells",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "Choose two level 3 spells in your spellbook as your signature spells. You always have these spells prepared, and you can cast each of them once at level 3 without expending a spell slot. When you do so, you can't cast them in this way again until you finish a Short or Long Rest. To cast either spell at a higher level, you must expend a spell slot."
    ],
    "url": "/api/2024/features/signature-spells"
  },
  {
    "index": "frenzy",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "subclass": {
      "index": "path-of-the-berserker",
      "name": "Path of the Berserker",
      "url": "/api/2024/subclasses/path-of-the-berserker"
    },
    "name": "Frenzy",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "If you use Reckless Attack while your Rage is active, you deal extra damage to the first target you hit on your turn with a Strength-based attack. To determine the extra damage, roll a number of d6s equal to your Rage Damage bonus, and add them together. The damage has the same type as the weapon or Unarmed Strike used for the attack."
    ],
    "url": "/api/2024/features/frenzy"
  },
  {
    "index": "mindless-rage",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "subclass": {
      "index": "path-of-the-berserker",
      "name": "Path of the Berserker",
      "url": "/api/2024/subclasses/path-of-the-berserker"
    },
    "name": "Mindless Rage",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You have Immunity to the Charmed and Frightened conditions while your Rage is active. If you're Charmed or Frightened when you enter your Rage, the condition ends on you."
    ],
    "url": "/api/2024/features/mindless-rage"
  },
  {
    "index": "retaliation",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "subclass": {
      "index": "path-of-the-berserker",
      "name": "Path of the Berserker",
      "url": "/api/2024/subclasses/path-of-the-berserker"
    },
    "name": "Retaliation",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "When you take damage from a creature that is within 5 feet of you, you can take a Reaction to make one melee attack against that creature, using a weapon or an Unarmed Strike."
    ],
    "url": "/api/2024/features/retaliation"
  },
  {
    "index": "intimidating-presence",
    "class": {
      "index": "barbarian",
      "name": "Barbarian",
      "url": "/api/2024/classes/barbarian"
    },
    "subclass": {
      "index": "path-of-the-berserker",
      "name": "Path of the Berserker",
      "url": "/api/2024/subclasses/path-of-the-berserker"
    },
    "name": "Intimidating Presence",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "As a Bonus Action, you can strike terror into others with your menacing presence and primal power. When you do so, each creature of your choice in a 30-foot Emanation originating from you must make a Wisdom saving throw (DC 8 plus your Strength modifier and Proficiency Bonus). On a failed save, a creature has the Frightened condition for 1 minute. At the end of each of the Frightened creature's turns, the creature repeats the save, ending the effect on itself on a success.",
      "Once you use this feature, you can't use it again until you finish a Long Rest unless you expend a use of your Rage (no action required) to restore your use of it."
    ],
    "url": "/api/2024/features/intimidating-presence"
  },
  {
    "index": "bonus-proficiencies-lore",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "subclass": {
      "index": "college-of-lore",
      "name": "College of Lore",
      "url": "/api/2024/subclasses/college-of-lore"
    },
    "name": "Bonus Proficiencies",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain proficiency with three skills of your choice."
    ],
    "url": "/api/2024/features/bonus-proficiencies-lore"
  },
  {
    "index": "cutting-words",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "subclass": {
      "index": "college-of-lore",
      "name": "College of Lore",
      "url": "/api/2024/subclasses/college-of-lore"
    },
    "name": "Cutting Words",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You learn to use your wit to supernaturally distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of yourself makes a damage roll or succeeds on an ability check or attack roll, you can take a Reaction to expend one use of your Bardic Inspiration; roll your Bardic Inspiration die, and subtract the number rolled from the creature's roll, reducing the damage or potentially turning the success into a failure."
    ],
    "url": "/api/2024/features/cutting-words"
  },
  {
    "index": "magical-discoveries",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "subclass": {
      "index": "college-of-lore",
      "name": "College of Lore",
      "url": "/api/2024/subclasses/college-of-lore"
    },
    "name": "Magical Discoveries",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You learn two spells of your choice. These spells can come from the Cleric, Druid, or Wizard spell list or any combination thereof (see a class's section for its spell list). A spell you choose must be a cantrip or a spell for which you have spell slots, as shown in the Bard Features table.",
      "You always have the chosen spells prepared, and whenever you gain a Bard level, you can replace one of the spells with another spell that meets these requirements."
    ],
    "url": "/api/2024/features/magical-discoveries"
  },
  {
    "index": "peerless-skill",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "subclass": {
      "index": "college-of-lore",
      "name": "College of Lore",
      "url": "/api/2024/subclasses/college-of-lore"
    },
    "name": "Peerless Skill",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "When you make an ability check or attack roll and fail, you can expend one use of Bardic Inspiration; roll the Bardic Inspiration die, and add the number rolled to the d20, potentially turning a failure into a success. On a failure, the Bardic Inspiration isn't expended."
    ],
    "url": "/api/2024/features/peerless-skill"
  },
  {
    "index": "disciple-of-life",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "subclass": {
      "index": "life-domain",
      "name": "Life Domain",
      "url": "/api/2024/subclasses/life-domain"
    },
    "name": "Disciple of Life",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "When a spell you cast with a spell slot restores Hit Points to a creature, that creature regains additional Hit Points on the turn you cast the spell. The additional Hit Points equal 2 plus the spell slot's level."
    ],
    "url": "/api/2024/features/disciple-of-life"
  },
  {
    "index": "preserve-life",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "subclass": {
      "index": "life-domain",
      "name": "Life Domain",
      "url": "/api/2024/subclasses/life-domain"
    },
    "name": "Preserve Life",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "As a Magic action, you present your Holy Symbol and expend a use of your Channel Divinity to evoke healing energy that can restore a number of Hit Points equal to five times your Cleric level. Choose Bloodied creatures within 30 feet of yourself (which can include you), and divide those Hit Points among them. This feature can restore a creature to no more than half its Hit Point maximum."
    ],
    "url": "/api/2024/features/preserve-life"
  },
  {
    "index": "blessed-healer",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "subclass": {
      "index": "life-domain",
      "name": "Life Domain",
      "url": "/api/2024/subclasses/life-domain"
    },
    "name": "Blessed Healer",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "The healing spells you cast on others heal you as well. Immediately after you cast a spell with a spell slot that restores Hit Points to one or more creatures other than yourself, you regain Hit Points equal to 2 plus the spell slot's level."
    ],
    "url": "/api/2024/features/blessed-healer"
  },
  {
    "index": "supreme-healing",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "subclass": {
      "index": "life-domain",
      "name": "Life Domain",
      "url": "/api/2024/subclasses/life-domain"
    },
    "name": "Supreme Healing",
    "level": 17,
    "prerequisites": [],
    "desc": [
      "When you would normally roll one or more dice to restore Hit Points to a creature with a spell or Channel Divinity, don't roll those dice for the healing; instead use the highest number possible for each die. For example, instead of restoring 2d6 Hit Points to a creature with a spell, you restore 12."
    ],
    "url": "/api/2024/features/supreme-healing"
  },
  {
    "index": "circle-of-the-land-spells",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "subclass": {
      "index": "circle-of-the-land",
      "name": "Circle of the Land",
      "url": "/api/2024/subclasses/circle-of-the-land"
    },
    "name": "Circle of the Land Spells",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "Whenever you finish a Long Rest, choose one type of land: arid, polar, temperate, or tropical. Consult the table below that corresponds to the chosen type; you have the spells listed for your Druid level and lower prepared."
    ],
    "url": "/api/2024/features/circle-of-the-land-spells"
  },
  {
    "index": "lands-aid",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "subclass": {
      "index": "circle-of-the-land",
      "name": "Circle of the Land",
      "url": "/api/2024/subclasses/circle-of-the-land"
    },
    "name": "Land's Aid",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "As a Magic action, you can expend a use of your Wild Shape and choose a point within 60 feet of yourself. Vitality-giving flowers and life-draining thorns appear for a moment in a 10-foot-radius Sphere centered on that point. Each creature of your choice in the Sphere must make a Constitution saving throw against your spell save DC, taking 2d6 Necrotic damage on a failed save or half as much damage on a successful one."
    ],
    "url": "/api/2024/features/lands-aid"
  },
  {
    "index": "natural-recovery",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "subclass": {
      "index": "circle-of-the-land",
      "name": "Circle of the Land",
      "url": "/api/2024/subclasses/circle-of-the-land"
    },
    "name": "Natural Recovery",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You can cast one of the level 1+ spells that you have prepared from your Circle Spells feature without expending a spell slot, and you must finish a Long Rest before you do so again.",
      "In addition, when you finish a Short Rest, you can choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your Druid level (round up), and none of them can be level 6+. For example, if you're a level 6 Druid, you can recover up to three levels' worth of spell slots. You can recover a level 3 spell slot, a level 2 and a level 1 spell slot, or three level 1 spell slots.",
      "Once you recover spell slots with this feature, you can't do so again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/natural-recovery"
  },
  {
    "index": "natures-ward",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "subclass": {
      "index": "circle-of-the-land",
      "name": "Circle of the Land",
      "url": "/api/2024/subclasses/circle-of-the-land"
    },
    "name": "Nature's Ward",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "You are immune to the Poisoned condition, and you have Resistance to a damage type associated with your current land choice in the Circle Spells feature, as shown in the Nature's Ward table."
    ],
    "url": "/api/2024/features/natures-ward"
  },
  {
    "index": "natures-sanctuary",
    "class": {
      "index": "druid",
      "name": "Druid",
      "url": "/api/2024/classes/druid"
    },
    "subclass": {
      "index": "circle-of-the-land",
      "name": "Circle of the Land",
      "url": "/api/2024/subclasses/circle-of-the-land"
    },
    "name": "Nature's Sanctuary",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "As a Magic action, you can expend a use of your Wild Shape and cause spectral trees and vines to appear in a 15-foot Cube on the ground within 120 feet of yourself. They last there for 1 minute or until you have the Incapacitated condition or die. You and your allies have Half Cover while in that area, and your allies gain the current Resistance of your Nature's Ward while there.",
      "As a Bonus Action, you can move the Cube up to 60 feet to ground within 120 feet of yourself."
    ],
    "url": "/api/2024/features/natures-sanctuary"
  },
  {
    "index": "improved-critical",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Improved Critical",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "Your attack rolls with weapons and Unarmed Strikes can score a Critical Hit on a roll of 19 or 20 on the d20."
    ],
    "url": "/api/2024/features/improved-critical"
  },
  {
    "index": "remarkable-athlete",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Remarkable Athlete",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "Thanks to your athleticism, you have Advantage on Initiative rolls and Strength (Athletics) checks.",
      "In addition, immediately after you score a Critical Hit, you can move up to half your Speed without provoking Opportunity Attacks."
    ],
    "url": "/api/2024/features/remarkable-athlete"
  },
  {
    "index": "additional-fighting-style",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Additional Fighting Style",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "You gain another Fighting Style feat of your choice."
    ],
    "url": "/api/2024/features/additional-fighting-style"
  },
  {
    "index": "heroic-warrior",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Heroic Warrior",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "The thrill of battle drives you toward victory. During combat, you can give yourself Heroic Inspiration whenever you start your turn without it."
    ],
    "url": "/api/2024/features/heroic-warrior"
  },
  {
    "index": "superior-critical",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Superior Critical",
    "level": 15,
    "prerequisites": [],
    "desc": [
      "Your attack rolls with weapons and Unarmed Strikes can now score a Critical Hit on a roll of 18–20 on the d20."
    ],
    "url": "/api/2024/features/superior-critical"
  },
  {
    "index": "survivor",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Survivor",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "You attain the pinnacle of resilience in battle, giving you these benefits.",
      "Defy Death. You have Advantage on Death Saving Throws. Moreover, when you roll 18–20 on a Death Saving Throw, you gain the benefit of rolling a 20 on it.",
      "Heroic Rally. At the start of each of your turns, you regain Hit Points equal to 5 plus your Constitution modifier if you are Bloodied and have at least 1 Hit Point."
    ],
    "url": "/api/2024/features/survivor"
  },
  {
    "index": "open-hand-technique",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "subclass": {
      "index": "warrior-of-the-open-hand",
      "name": "Warrior of the Open Hand",
      "url": "/api/2024/subclasses/warrior-of-the-open-hand"
    },
    "name": "Open Hand Technique",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "Whenever you hit a creature with an attack granted by your Flurry of Blows, you can impose one of the following effects on that target.",
      "Addle. The target can't make Opportunity Attacks until the start of its next turn.",
      "Push. The target must succeed on a Strength saving throw or be pushed up to 15 feet away from you.",
      "Topple. The target must succeed on a Dexterity saving throw or have the Prone condition."
    ],
    "url": "/api/2024/features/open-hand-technique"
  },
  {
    "index": "wholeness-of-body",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "subclass": {
      "index": "warrior-of-the-open-hand",
      "name": "Warrior of the Open Hand",
      "url": "/api/2024/subclasses/warrior-of-the-open-hand"
    },
    "name": "Wholeness of Body",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You gain the ability to heal yourself. As a Bonus Action, you can roll your Martial Arts die. You regain a number of Hit Points equal to the number rolled plus your Wisdom modifier (minimum of 1 Hit Point regained).",
      "You can use this feature a number of times equal to your Wisdom modifier (minimum of once), and you regain all expended uses when you finish a Long Rest."
    ],
    "url": "/api/2024/features/wholeness-of-body"
  },
  {
    "index": "fleet-step",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "subclass": {
      "index": "warrior-of-the-open-hand",
      "name": "Warrior of the Open Hand",
      "url": "/api/2024/subclasses/warrior-of-the-open-hand"
    },
    "name": "Fleet Step",
    "level": 11,
    "prerequisites": [],
    "desc": [
      "When you take a Bonus Action other than Step of the Wind, you can also use Step of the Wind immediately after that Bonus Action."
    ],
    "url": "/api/2024/features/fleet-step"
  },
  {
    "index": "quivering-palm",
    "class": {
      "index": "monk",
      "name": "Monk",
      "url": "/api/2024/classes/monk"
    },
    "subclass": {
      "index": "warrior-of-the-open-hand",
      "name": "Warrior of the Open Hand",
      "url": "/api/2024/subclasses/warrior-of-the-open-hand"
    },
    "name": "Quivering Palm",
    "level": 17,
    "prerequisites": [],
    "desc": [
      "You gain the ability to set up lethal vibrations in someone's body. When you hit a creature with an Unarmed Strike, you can expend 4 Focus Points to start these imperceptible vibrations, which last for a number of days equal to your Monk level. The vibrations are harmless unless you take an action to end them. Alternatively, when you take the Attack action on your turn, you can forgo one of the attacks to end the vibrations. To end them, you and the target must be on the same plane of existence.",
      "When you end them, the target must make a Constitution saving throw, taking 10d12 Force damage on a failed save or half as much damage on a successful one.",
      "You can have only one creature under the effect of this feature at a time. You can end the vibrations harmlessly (no action required)."
    ],
    "url": "/api/2024/features/quivering-palm"
  },
  {
    "index": "sacred-weapon",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "subclass": {
      "index": "oath-of-devotion",
      "name": "Oath of Devotion",
      "url": "/api/2024/subclasses/oath-of-devotion"
    },
    "name": "Sacred Weapon",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "When you take the Attack action, you can expend one use of your Channel Divinity to imbue one Melee weapon that you are holding with positive energy. For 10 minutes or until you use this feature again, you add your Charisma modifier to attack rolls you make with that weapon (minimum bonus of +1), and each time you hit with it, you cause it to deal its normal damage type or Radiant damage.",
      "The weapon also emits Bright Light in a 20-foot radius and Dim Light 20 feet beyond that.",
      "You can end this effect early (no action required). This effect also ends if you aren't carrying the weapon."
    ],
    "url": "/api/2024/features/sacred-weapon"
  },
  {
    "index": "aura-of-devotion",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "subclass": {
      "index": "oath-of-devotion",
      "name": "Oath of Devotion",
      "url": "/api/2024/subclasses/oath-of-devotion"
    },
    "name": "Aura of Devotion",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "You and your allies have Immunity to the Charmed condition while in your Aura of Protection. If a Charmed ally enters the aura, that condition has no effect on that ally while there."
    ],
    "url": "/api/2024/features/aura-of-devotion"
  },
  {
    "index": "smite-of-protection",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "subclass": {
      "index": "oath-of-devotion",
      "name": "Oath of Devotion",
      "url": "/api/2024/subclasses/oath-of-devotion"
    },
    "name": "Smite of Protection",
    "level": 15,
    "prerequisites": [],
    "desc": [
      "Your magical smite now radiates protective energy. Whenever you cast Divine Smite, you and your allies have Half Cover while in your Aura of Protection. The aura has this benefit until the start of your next turn."
    ],
    "url": "/api/2024/features/smite-of-protection"
  },
  {
    "index": "holy-nimbus",
    "class": {
      "index": "paladin",
      "name": "Paladin",
      "url": "/api/2024/classes/paladin"
    },
    "subclass": {
      "index": "oath-of-devotion",
      "name": "Oath of Devotion",
      "url": "/api/2024/subclasses/oath-of-devotion"
    },
    "name": "Holy Nimbus",
    "level": 20,
    "prerequisites": [],
    "desc": [
      "As a Bonus Action, you can imbue your Aura of Protection with holy power, granting the benefits below for 10 minutes or until you end them (no action required). Once you use this feature, you can't use it again until you finish a Long Rest. You can also restore your use of it by expending a level 5 spell slot (no action required).",
      "Holy Ward. You have Advantage on any saving throw you are forced to make by a Fiend or an Undead.",
      "Radiant Damage. Whenever an enemy starts its turn in the aura, that creature takes Radiant damage equal to your Charisma modifier plus your Proficiency Bonus.",
      "Sunlight. The aura is filled with Bright Light that is sunlight."
    ],
    "url": "/api/2024/features/holy-nimbus"
  },
  {
    "index": "hunters-prey",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "subclass": {
      "index": "hunter",
      "name": "Hunter",
      "url": "/api/2024/subclasses/hunter"
    },
    "name": "Hunter's Prey",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain one of the following feature options of your choice. Whenever you finish a Short or Long Rest, you can replace the chosen option with the other one.",
      "Colossus Slayer. Your tenacity can wear down even the most potent foes. When you hit a creature with a weapon, the weapon deals an extra 1d8 damage to the target if it's missing any of its Hit Points. You can deal this extra damage only once per turn.",
      "Giant Killer. When a Large or larger creature within 5 feet of you hits or misses you with an attack roll, you can take a Reaction to attack that creature immediately after its attack, provided that you can see the creature."
    ],
    "url": "/api/2024/features/hunters-prey"
  },
  {
    "index": "defensive-tactics",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "subclass": {
      "index": "hunter",
      "name": "Hunter",
      "url": "/api/2024/subclasses/hunter"
    },
    "name": "Defensive Tactics",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "You gain one of the following feature options of your choice. Whenever you finish a Short or Long Rest, you can replace the chosen option with the other one.",
      "Escape the Horde. Opportunity Attacks have Disadvantage against you.",
      "Multiattack Defense. When a creature hits you with an attack roll, that creature has Disadvantage on all other attack rolls against you this turn."
    ],
    "url": "/api/2024/features/defensive-tactics"
  },
  {
    "index": "superior-hunters-prey",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "subclass": {
      "index": "hunter",
      "name": "Hunter",
      "url": "/api/2024/subclasses/hunter"
    },
    "name": "Superior Hunter's Prey",
    "level": 11,
    "prerequisites": [],
    "desc": [
      "Once per turn when you deal damage to a creature marked by your Hunter's Mark, you can also deal that spell's extra damage to a different creature that you can see within 30 feet of the first creature."
    ],
    "url": "/api/2024/features/superior-hunters-prey"
  },
  {
    "index": "superior-hunters-defense",
    "class": {
      "index": "ranger",
      "name": "Ranger",
      "url": "/api/2024/classes/ranger"
    },
    "subclass": {
      "index": "hunter",
      "name": "Hunter",
      "url": "/api/2024/subclasses/hunter"
    },
    "name": "Superior Hunter's Defense",
    "level": 15,
    "prerequisites": [],
    "desc": [
      "When you take damage, you can take a Reaction to give yourself Resistance to that damage and any other damage of the same type until the end of the current turn."
    ],
    "url": "/api/2024/features/superior-hunters-defense"
  },
  {
    "index": "fast-hands",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "subclass": {
      "index": "thief",
      "name": "Thief",
      "url": "/api/2024/subclasses/thief"
    },
    "name": "Fast Hands",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "As a Bonus Action, you can do one of the following.",
      "Sleight of Hand. Make a Dexterity (Sleight of Hand) check to pick a lock or disarm a trap with Thieves' Tools or to pick a pocket.",
      "Use an Object. Take the Utilize action, or take the Magic action to use a magic item that requires that action."
    ],
    "url": "/api/2024/features/fast-hands"
  },
  {
    "index": "second-story-work",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "subclass": {
      "index": "thief",
      "name": "Thief",
      "url": "/api/2024/subclasses/thief"
    },
    "name": "Second-Story Work",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You've trained to get into especially hard-to-reach places, granting you these benefits.",
      "Climber. You gain a Climb Speed equal to your Speed.",
      "Jumper. You can determine your jump distance using your Dexterity rather than your Strength."
    ],
    "url": "/api/2024/features/second-story-work"
  },
  {
    "index": "supreme-sneak",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "subclass": {
      "index": "thief",
      "name": "Thief",
      "url": "/api/2024/subclasses/thief"
    },
    "name": "Supreme Sneak",
    "level": 9,
    "prerequisites": [],
    "desc": [
      "You gain the following Cunning Strike option.",
      "Stealth Attack (Cost: 1d6). If you have the Hide action's Invisible condition, this attack doesn't end that condition on you if you end the turn behind Three-Quarters Cover or Total Cover."
    ],
    "url": "/api/2024/features/supreme-sneak"
  },
  {
    "index": "use-magic-device",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "subclass": {
      "index": "thief",
      "name": "Thief",
      "url": "/api/2024/subclasses/thief"
    },
    "name": "Use Magic Device",
    "level": 13,
    "prerequisites": [],
    "desc": [
      "You've learned how to maximize use of magic items, granting you the following benefits.",
      "Attunement. You can attune to up to four magic items at once.",
      "Charges. Whenever you use a magic item property that expends charges, roll 1d6. On a roll of 6, you use the property without expending the charges.",
      "Scrolls. You can use any Spell Scroll, using Intelligence as your spellcasting ability for the spell. If the spell is a cantrip or a level 1 spell, you can cast it reliably. If the scroll contains a higher-level spell, you must first succeed on an Intelligence (Arcana) check (DC 10 plus the spell's level). On a successful check, you cast the spell from the scroll. On a failed check, the scroll disintegrates."
    ],
    "url": "/api/2024/features/use-magic-device"
  },
  {
    "index": "thiefs-reflexes",
    "class": {
      "index": "rogue",
      "name": "Rogue",
      "url": "/api/2024/classes/rogue"
    },
    "subclass": {
      "index": "thief",
      "name": "Thief",
      "url": "/api/2024/subclasses/thief"
    },
    "name": "Thief's Reflexes",
    "level": 17,
    "prerequisites": [],
    "desc": [
      "You are adept at laying ambushes and quickly escaping danger. You can take two turns during the first round of any combat. You take your first turn at your normal Initiative and your second turn at your Initiative minus 10."
    ],
    "url": "/api/2024/features/thiefs-reflexes"
  },
  {
    "index": "draconic-resilience",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "subclass": {
      "index": "draconic-sorcery",
      "name": "Draconic Sorcery",
      "url": "/api/2024/subclasses/draconic-sorcery"
    },
    "name": "Draconic Resilience",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "The magic in your body manifests physical traits of your draconic gift. Your Hit Point maximum increases by 3, and it increases by 1 whenever you gain another Sorcerer level.",
      "Parts of you are also covered by dragon-like scales. While you aren't wearing armor, your base Armor Class equals 10 plus your Dexterity and Charisma modifiers."
    ],
    "url": "/api/2024/features/draconic-resilience"
  },
  {
    "index": "elemental-affinity",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "subclass": {
      "index": "draconic-sorcery",
      "name": "Draconic Sorcery",
      "url": "/api/2024/subclasses/draconic-sorcery"
    },
    "name": "Elemental Affinity",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "Your draconic magic has an affinity with a damage type associated with dragons. Choose one of those types: Acid, Cold, Fire, Lightning, or Poison.",
      "You have Resistance to that damage type, and when you cast a spell that deals damage of that type, you can add your Charisma modifier to one damage roll of that spell."
    ],
    "url": "/api/2024/features/elemental-affinity"
  },
  {
    "index": "dragon-wings",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "subclass": {
      "index": "draconic-sorcery",
      "name": "Draconic Sorcery",
      "url": "/api/2024/subclasses/draconic-sorcery"
    },
    "name": "Dragon Wings",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "As a Bonus Action, you can cause draconic wings to appear on your back. The wings last for 1 hour or until you dismiss them (no action required). For the duration, you have a Fly Speed of 60 feet.",
      "Once you use this feature, you can't use it again until you finish a Long Rest unless you spend 3 Sorcery Points (no action required) to restore your use of it."
    ],
    "url": "/api/2024/features/dragon-wings"
  },
  {
    "index": "dragon-companion",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "subclass": {
      "index": "draconic-sorcery",
      "name": "Draconic Sorcery",
      "url": "/api/2024/subclasses/draconic-sorcery"
    },
    "name": "Dragon Companion",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "You can cast Summon Dragon without a Material component. You can also cast it once without a spell slot, and you regain the ability to cast it in this way when you finish a Long Rest.",
      "Whenever you start casting the spell, you can modify it so that it doesn't require Concentration. If you do so, the spell's duration becomes 1 minute for that casting."
    ],
    "url": "/api/2024/features/dragon-companion"
  },
  {
    "index": "dark-ones-blessing",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "subclass": {
      "index": "fiend-patron",
      "name": "Fiend Patron",
      "url": "/api/2024/subclasses/fiend-patron"
    },
    "name": "Dark One's Blessing",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "When you reduce an enemy to 0 Hit Points, you gain Temporary Hit Points equal to your Charisma modifier plus your Warlock level (minimum of 1 Temporary Hit Point). You also gain this benefit if someone else reduces an enemy within 10 feet of you to 0 Hit Points."
    ],
    "url": "/api/2024/features/dark-ones-blessing"
  },
  {
    "index": "dark-ones-own-luck",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "subclass": {
      "index": "fiend-patron",
      "name": "Fiend Patron",
      "url": "/api/2024/subclasses/fiend-patron"
    },
    "name": "Dark One's Own Luck",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You can call on your fiendish patron to alter fate in your favor. When you make an ability check or a saving throw, you can use this feature to add 1d10 to your roll. You can do so after seeing the roll but before any of the roll's effects occur.",
      "You can use this feature a number of times equal to your Charisma modifier (minimum of once), but you can use it no more than once per roll. You regain all expended uses when you finish a Long Rest."
    ],
    "url": "/api/2024/features/dark-ones-own-luck"
  },
  {
    "index": "fiendish-resilience",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "subclass": {
      "index": "fiend-patron",
      "name": "Fiend Patron",
      "url": "/api/2024/subclasses/fiend-patron"
    },
    "name": "Fiendish Resilience",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "Choose one damage type, other than Force, whenever you finish a Short or Long Rest. You have Resistance to that damage type until you choose a different one with this feature."
    ],
    "url": "/api/2024/features/fiendish-resilience"
  },
  {
    "index": "hurl-through-hell",
    "class": {
      "index": "warlock",
      "name": "Warlock",
      "url": "/api/2024/classes/warlock"
    },
    "subclass": {
      "index": "fiend-patron",
      "name": "Fiend Patron",
      "url": "/api/2024/subclasses/fiend-patron"
    },
    "name": "Hurl Through Hell",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "Once per turn when you hit a creature with an attack roll, you can try to instantly transport the target through the Lower Planes. The target must succeed on a Charisma saving throw against your spell save DC, or the target disappears and hurtles through a nightmare landscape. The target takes 8d10 Psychic damage if it isn't a Fiend, and it has the Incapacitated condition until the end of your next turn, when it returns to the space it previously occupied or the nearest unoccupied space.",
      "Once you use this feature, you can't use it again until you finish a Long Rest unless you expend a Pact Magic spell slot (no action required) to restore your use of it."
    ],
    "url": "/api/2024/features/hurl-through-hell"
  },
  {
    "index": "evocation-savant",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "subclass": {
      "index": "evoker",
      "name": "Evoker",
      "url": "/api/2024/subclasses/evoker"
    },
    "name": "Evocation Savant",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "Choose two Wizard spells from the Evocation school, each of which must be no higher than level 2, and add them to your spellbook for free.",
      "In addition, whenever you gain access to a new level of spell slots in this class, you can add one Wizard spell from the Evocation school to your spellbook for free. The chosen spell must be of a level for which you have spell slots."
    ],
    "url": "/api/2024/features/evocation-savant"
  },
  {
    "index": "sculpt-spells",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "subclass": {
      "index": "evoker",
      "name": "Evoker",
      "url": "/api/2024/subclasses/evoker"
    },
    "name": "Sculpt Spells",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You can create pockets of relative safety within the effects of your evocations. When you cast an Evocation spell that affects other creatures that you can see, you can choose a number of them equal to 1 plus the spell's level. The chosen creatures automatically succeed on their saving throws against the spell, and they take no damage if they would normally take half damage on a successful save."
    ],
    "url": "/api/2024/features/sculpt-spells"
  },
  {
    "index": "potent-cantrip",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "subclass": {
      "index": "evoker",
      "name": "Evoker",
      "url": "/api/2024/subclasses/evoker"
    },
    "name": "Potent Cantrip",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "Your damaging cantrips affect even creatures that avoid the brunt of the effect. When you cast a cantrip at a creature and you miss with the attack roll or the target succeeds on a saving throw against the cantrip, the target takes half the cantrip's damage (if any) but suffers no additional effect from the cantrip."
    ],
    "url": "/api/2024/features/potent-cantrip"
  },
  {
    "index": "empowered-evocation",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "subclass": {
      "index": "evoker",
      "name": "Evoker",
      "url": "/api/2024/subclasses/evoker"
    },
    "name": "Empowered Evocation",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "Whenever you cast a Wizard spell from the Evocation school, you can add your Intelligence modifier to one damage roll of that spell."
    ],
    "url": "/api/2024/features/empowered-evocation"
  },
  {
    "index": "overchannel",
    "class": {
      "index": "wizard",
      "name": "Wizard",
      "url": "/api/2024/classes/wizard"
    },
    "subclass": {
      "index": "evoker",
      "name": "Evoker",
      "url": "/api/2024/subclasses/evoker"
    },
    "name": "Overchannel",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "You can increase the power of your spells. When you cast a Wizard spell with a spell slot of levels 1–5 that deals damage, you can deal maximum damage with that spell on the turn you cast it.",
      "The first time you do so, you suffer no adverse effect. If you use this feature again before you finish a Long Rest, you take 2d12 Necrotic damage for each level of the spell slot immediately after you cast it. This damage ignores Resistance and Immunity.",
      "Each time you use this feature again before finishing a Long Rest, the Necrotic damage per spell level increases by 1d12."
    ],
    "url": "/api/2024/features/overchannel"
  },
  {
    "index": "improved-critical-champion",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Improved Critical",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "Your attack rolls with weapons and Unarmed Strikes can score a Critical Hit on a roll of 19 or 20 on the d20."
    ],
    "url": "/api/2024/features/improved-critical-champion"
  },
  {
    "index": "remarkable-athlete-champion",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Remarkable Athlete",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "Thanks to your athleticism, you have Advantage on Initiative rolls and Strength (Athletics) checks.",
      "In addition, immediately after you score a Critical Hit, you can move up to half your Speed without provoking Opportunity Attacks."
    ],
    "url": "/api/2024/features/remarkable-athlete-champion"
  },
  {
    "index": "additional-fighting-style-champion",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Additional Fighting Style",
    "level": 7,
    "prerequisites": [],
    "desc": [
      "You gain another Fighting Style feat of your choice."
    ],
    "url": "/api/2024/features/additional-fighting-style-champion"
  },
  {
    "index": "heroic-warrior-champion",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Heroic Warrior",
    "level": 10,
    "prerequisites": [],
    "desc": [
      "The thrill of battle drives you toward victory. During combat, you can give yourself Heroic Inspiration whenever you start your turn without it."
    ],
    "url": "/api/2024/features/heroic-warrior-champion"
  },
  {
    "index": "superior-critical-champion",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Superior Critical",
    "level": 15,
    "prerequisites": [],
    "desc": [
      "Your attack rolls with weapons and Unarmed Strikes can now score a Critical Hit on a roll of 18–20 on the d20."
    ],
    "url": "/api/2024/features/superior-critical-champion"
  },
  {
    "index": "survivor-champion",
    "class": {
      "index": "fighter",
      "name": "Fighter",
      "url": "/api/2024/classes/fighter"
    },
    "subclass": {
      "index": "champion",
      "name": "Champion",
      "url": "/api/2024/subclasses/champion"
    },
    "name": "Survivor",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "You attain the pinnacle of resilience in battle, giving you these benefits.",
      "Defy Death. You have Advantage on Death Saving Throws. Moreover, when you roll 18–20 on a Death Saving Throw, you gain the benefit of rolling a 20 on it.",
      "Heroic Rally. At the start of each of your turns, you regain Hit Points equal to 5 plus your Constitution modifier if you are Bloodied and have at least 1 Hit Point."
    ],
    "url": "/api/2024/features/survivor-champion"
  },
  {
    "index": "bonus-proficiencies-college-of-lore",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "subclass": {
      "index": "college-of-lore",
      "name": "College of Lore",
      "url": "/api/2024/subclasses/college-of-lore"
    },
    "name": "Bonus Proficiencies",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You gain proficiency with three skills of your choice."
    ],
    "url": "/api/2024/features/bonus-proficiencies-college-of-lore"
  },
  {
    "index": "cutting-words-college-of-lore",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "subclass": {
      "index": "college-of-lore",
      "name": "College of Lore",
      "url": "/api/2024/subclasses/college-of-lore"
    },
    "name": "Cutting Words",
    "level": 3,
    "prerequisites": [],
    "desc": [
      "You learn to use your wit to supernaturally distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of yourself makes a damage roll or succeeds on an ability check or attack roll, you can take a Reaction to expend one use of your Bardic Inspiration; roll your Bardic Inspiration die, and subtract the number rolled from the creature's roll, reducing the damage or potentially turning the success into a failure."
    ],
    "url": "/api/2024/features/cutting-words-college-of-lore"
  },
  {
    "index": "magical-discoveries-college-of-lore",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "subclass": {
      "index": "college-of-lore",
      "name": "College of Lore",
      "url": "/api/2024/subclasses/college-of-lore"
    },
    "name": "Magical Discoveries",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "You learn two spells of your choice. These spells can come from the Cleric, Druid, or Wizard spell list or any combination thereof (see a class's section for its spell list). A spell you choose must be a cantrip or a spell for which you have spell slots, as shown in the Bard Features table.",
      "You always have the chosen spells prepared, and whenever you gain a Bard level, you can replace one of the spells with another spell that meets these requirements."
    ],
    "url": "/api/2024/features/magical-discoveries-college-of-lore"
  },
  {
    "index": "peerless-skill-college-of-lore",
    "class": {
      "index": "bard",
      "name": "Bard",
      "url": "/api/2024/classes/bard"
    },
    "subclass": {
      "index": "college-of-lore",
      "name": "College of Lore",
      "url": "/api/2024/subclasses/college-of-lore"
    },
    "name": "Peerless Skill",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "When you make an ability check or attack roll and fail, you can expend one use of Bardic Inspiration; roll the Bardic Inspiration die, and add the number rolled to the d20, potentially turning a failure into a success. On a failure, the Bardic Inspiration isn't expended."
    ],
    "url": "/api/2024/features/peerless-skill-college-of-lore"
  },
  {
    "index": "disciple-of-life-life-domain",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "subclass": {
      "index": "life-domain",
      "name": "Life Domain",
      "url": "/api/2024/subclasses/life-domain"
    },
    "name": "Disciple of Life",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "When a spell you cast with a spell slot restores Hit Points to a creature, that creature regains additional Hit Points on the turn you cast the spell. The additional Hit Points equal 2 plus the spell slot's level."
    ],
    "url": "/api/2024/features/disciple-of-life-life-domain"
  },
  {
    "index": "preserve-life-life-domain",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "subclass": {
      "index": "life-domain",
      "name": "Life Domain",
      "url": "/api/2024/subclasses/life-domain"
    },
    "name": "Preserve Life",
    "level": 2,
    "prerequisites": [],
    "desc": [
      "As a Magic action, you present your Holy Symbol and expend a use of your Channel Divinity to evoke healing energy that can restore a number of Hit Points equal to five times your Cleric level. Choose Bloodied creatures within 30 feet of yourself (which can include you), and divide those Hit Points among them. This feature can restore a creature to no more than half its Hit Point maximum."
    ],
    "url": "/api/2024/features/preserve-life-life-domain"
  },
  {
    "index": "blessed-healer-life-domain",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "subclass": {
      "index": "life-domain",
      "name": "Life Domain",
      "url": "/api/2024/subclasses/life-domain"
    },
    "name": "Blessed Healer",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "The healing spells you cast on others heal you as well. Immediately after you cast a spell with a spell slot that restores Hit Points to one or more creatures other than yourself, you regain Hit Points equal to 2 plus the spell slot's level."
    ],
    "url": "/api/2024/features/blessed-healer-life-domain"
  },
  {
    "index": "divine-strike-life-domain",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "subclass": {
      "index": "life-domain",
      "name": "Life Domain",
      "url": "/api/2024/subclasses/life-domain"
    },
    "name": "Divine Strike",
    "level": 8,
    "prerequisites": [],
    "desc": [
      "Once on each of your turns when you hit a creature with an attack roll using a weapon, you can cause the target to take an extra 1d8 Necrotic or Radiant damage (your choice)."
    ],
    "url": "/api/2024/features/divine-strike-life-domain"
  },
  {
    "index": "supreme-healing-life-domain",
    "class": {
      "index": "cleric",
      "name": "Cleric",
      "url": "/api/2024/classes/cleric"
    },
    "subclass": {
      "index": "life-domain",
      "name": "Life Domain",
      "url": "/api/2024/subclasses/life-domain"
    },
    "name": "Supreme Healing",
    "level": 17,
    "prerequisites": [],
    "desc": [
      "When you would normally roll one or more dice to restore Hit Points to a creature with a spell or Channel Divinity, don't roll those dice for the healing; instead use the highest number possible for each die. For example, instead of restoring 2d6 Hit Points to a creature with a spell, you restore 12."
    ],
    "url": "/api/2024/features/supreme-healing-life-domain"
  },
  {
    "index": "draconic-resilience",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "subclass": {
      "index": "draconic-bloodline",
      "name": "Draconic Bloodline",
      "url": "/api/2024/subclasses/draconic-bloodline"
    },
    "name": "Draconic Resilience",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "The magic in your body manifests physical traits of your draconic gift. Your Hit Point maximum increases by 3, and it increases by 1 whenever you gain another Sorcerer level.",
      "Parts of you are also covered by dragon-like scales. While you aren't wearing armor, your base Armor Class equals 10 plus your Dexterity and Charisma modifiers."
    ],
    "url": "/api/2024/features/draconic-resilience"
  },
  {
    "index": "elemental-affinity",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "subclass": {
      "index": "draconic-bloodline",
      "name": "Draconic Bloodline",
      "url": "/api/2024/subclasses/draconic-bloodline"
    },
    "name": "Elemental Affinity",
    "level": 6,
    "prerequisites": [],
    "desc": [
      "Your draconic magic has an affinity with a damage type associated with dragons. Choose one of those types: Acid, Cold, Fire, Lightning, or Poison.",
      "You have Resistance to that damage type, and when you cast a spell that deals damage of that type, you can add your Charisma modifier to one damage roll of that spell."
    ],
    "url": "/api/2024/features/elemental-affinity"
  },
  {
    "index": "dragon-wings",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "subclass": {
      "index": "draconic-bloodline",
      "name": "Draconic Bloodline",
      "url": "/api/2024/subclasses/draconic-bloodline"
    },
    "name": "Dragon Wings",
    "level": 14,
    "prerequisites": [],
    "desc": [
      "As a Bonus Action, you can cause draconic wings to appear on your back. The wings last for 1 hour or until you dismiss them (no action required). For the duration, you have a Fly Speed of 60 feet.",
      "Once you use this feature, you can't use it again until you finish a Long Rest unless you spend 3 Sorcery Points (no action required) to restore your use of it."
    ],
    "url": "/api/2024/features/dragon-wings"
  },
  {
    "index": "dragon-companion",
    "class": {
      "index": "sorcerer",
      "name": "Sorcerer",
      "url": "/api/2024/classes/sorcerer"
    },
    "subclass": {
      "index": "draconic-bloodline",
      "name": "Draconic Bloodline",
      "url": "/api/2024/subclasses/draconic-bloodline"
    },
    "name": "Dragon Companion",
    "level": 18,
    "prerequisites": [],
    "desc": [
      "You can cast Summon Dragon without a Material component. You can also cast it once without a spell slot, and you regain the ability to cast it in this way when you finish a Long Rest.",
      "Whenever you start casting the spell, you can modify it so that it doesn't require Concentration. If you do so, the spell's duration becomes 1 minute for that casting."
    ],
    "url": "/api/2024/features/dragon-companion"
  },
  {
    "index": "draconic-ancestry",
    "species": {
      "index": "dragonborn",
      "name": "Dragonborn",
      "url": "/api/2024/species/dragonborn"
    },
    "name": "Draconic Ancestry",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Your lineage stems from a dragon progenitor. Choose the kind of dragon from the Draconic Ancestors table. Your choice affects your Breath Weapon and Damage Resistance traits as well as your appearance.",
      "Dragon types available: Black (Acid), Blue (Lightning), Brass (Fire), Bronze (Lightning), Copper (Acid), Gold (Fire), Green (Poison), Red (Fire), Silver (Cold), White (Cold)."
    ],
    "url": "/api/2024/features/draconic-ancestry"
  },
  {
    "index": "breath-weapon",
    "species": {
      "index": "dragonborn",
      "name": "Dragonborn",
      "url": "/api/2024/species/dragonborn"
    },
    "name": "Breath Weapon",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "When you take the Attack action on your turn, you can replace one of your attacks with an exhalation of magical energy in either a 15-foot Cone or a 30-foot Line that is 5 feet wide (choose the shape each time).",
      "Each creature in that area must make a Dexterity saving throw (DC 8 plus your Constitution modifier and Proficiency Bonus). On a failed save, a creature takes 1d10 damage of the type determined by your Draconic Ancestry trait. On a successful save, a creature takes half as much damage.",
      "This damage increases by 1d10 when you reach character levels 5 (2d10), 11 (3d10), and 17 (4d10).",
      "You can use this Breath Weapon a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Long Rest."
    ],
    "url": "/api/2024/features/breath-weapon"
  },
  {
    "index": "damage-resistance-dragonborn",
    "species": {
      "index": "dragonborn",
      "name": "Dragonborn",
      "url": "/api/2024/species/dragonborn"
    },
    "name": "Damage Resistance",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Resistance to the damage type determined by your Draconic Ancestry trait."
    ],
    "url": "/api/2024/features/damage-resistance-dragonborn"
  },
  {
    "index": "darkvision-dragonborn",
    "species": {
      "index": "dragonborn",
      "name": "Dragonborn",
      "url": "/api/2024/species/dragonborn"
    },
    "name": "Darkvision",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Darkvision with a range of 60 feet."
    ],
    "url": "/api/2024/features/darkvision-dragonborn"
  },
  {
    "index": "draconic-flight",
    "species": {
      "index": "dragonborn",
      "name": "Dragonborn",
      "url": "/api/2024/species/dragonborn"
    },
    "name": "Draconic Flight",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "When you reach character level 5, you can channel draconic magic to give yourself temporary flight. As a Bonus Action, you sprout spectral wings on your back that last for 10 minutes or until you retract the wings (no action required) or have the Incapacitated condition.",
      "During that time, you have a Fly Speed equal to your Speed. Your wings appear to be made of the same energy as your Breath Weapon.",
      "Once you use this trait, you can't use it again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/draconic-flight"
  },
  {
    "index": "darkvision-dwarf",
    "species": {
      "index": "dwarf",
      "name": "Dwarf",
      "url": "/api/2024/species/dwarf"
    },
    "name": "Darkvision",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Darkvision with a range of 120 feet."
    ],
    "url": "/api/2024/features/darkvision-dwarf"
  },
  {
    "index": "dwarven-resilience",
    "species": {
      "index": "dwarf",
      "name": "Dwarf",
      "url": "/api/2024/species/dwarf"
    },
    "name": "Dwarven Resilience",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Resistance to Poison damage. You also have Advantage on saving throws you make to avoid or end the Poisoned condition."
    ],
    "url": "/api/2024/features/dwarven-resilience"
  },
  {
    "index": "dwarven-toughness",
    "species": {
      "index": "dwarf",
      "name": "Dwarf",
      "url": "/api/2024/species/dwarf"
    },
    "name": "Dwarven Toughness",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "Your Hit Point maximum increases by 1, and it increases by 1 again whenever you gain a level."
    ],
    "url": "/api/2024/features/dwarven-toughness"
  },
  {
    "index": "stonecunning",
    "species": {
      "index": "dwarf",
      "name": "Dwarf",
      "url": "/api/2024/species/dwarf"
    },
    "name": "Stonecunning",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "As a Bonus Action, you gain Tremorsense with a range of 60 feet for 10 minutes. You must be on a stone surface or touching a stone surface to use this Tremorsense. The stone can be natural or worked.",
      "You can use this Bonus Action a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Long Rest."
    ],
    "url": "/api/2024/features/stonecunning"
  },
  {
    "index": "darkvision-elf",
    "species": {
      "index": "elf",
      "name": "Elf",
      "url": "/api/2024/species/elf"
    },
    "name": "Darkvision",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Darkvision with a range of 60 feet."
    ],
    "url": "/api/2024/features/darkvision-elf"
  },
  {
    "index": "elven-lineage",
    "species": {
      "index": "elf",
      "name": "Elf",
      "url": "/api/2024/species/elf"
    },
    "name": "Elven Lineage",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You are part of a lineage that grants you supernatural abilities. Choose a lineage from the Elven Lineages table. You gain the level 1 benefit of that lineage.",
      "When you reach character levels 3 and 5, you learn a higher-level spell, as shown on the table. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have of the appropriate level.",
      "Drow: The range of your Darkvision increases to 120 feet. You also know the Dancing Lights cantrip. Level 3: Faerie Fire. Level 5: Darkness.",
      "High Elf: You know the Prestidigitation cantrip. Whenever you finish a Long Rest, you can replace that cantrip with a different cantrip from the Wizard spell list. Level 3: Detect Magic. Level 5: Misty Step.",
      "Wood Elf: Your Speed increases to 35 feet. You also know the Druidcraft cantrip. Level 3: Longstrider. Level 5: Pass without Trace.",
      "Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the lineage)."
    ],
    "url": "/api/2024/features/elven-lineage"
  },
  {
    "index": "fey-ancestry",
    "species": {
      "index": "elf",
      "name": "Elf",
      "url": "/api/2024/species/elf"
    },
    "name": "Fey Ancestry",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Advantage on saving throws you make to avoid or end the Charmed condition."
    ],
    "url": "/api/2024/features/fey-ancestry"
  },
  {
    "index": "keen-senses",
    "species": {
      "index": "elf",
      "name": "Elf",
      "url": "/api/2024/species/elf"
    },
    "name": "Keen Senses",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have proficiency in the Insight, Perception, or Survival skill."
    ],
    "url": "/api/2024/features/keen-senses"
  },
  {
    "index": "trance",
    "species": {
      "index": "elf",
      "name": "Elf",
      "url": "/api/2024/species/elf"
    },
    "name": "Trance",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You don't need to sleep, and magic can't put you to sleep. You can finish a Long Rest in 4 hours if you spend those hours in a trancelike meditation, during which you retain consciousness."
    ],
    "url": "/api/2024/features/trance"
  },
  {
    "index": "darkvision-gnome",
    "species": {
      "index": "gnome",
      "name": "Gnome",
      "url": "/api/2024/species/gnome"
    },
    "name": "Darkvision",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Darkvision with a range of 60 feet."
    ],
    "url": "/api/2024/features/darkvision-gnome"
  },
  {
    "index": "gnomish-cunning",
    "species": {
      "index": "gnome",
      "name": "Gnome",
      "url": "/api/2024/species/gnome"
    },
    "name": "Gnomish Cunning",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Advantage on Intelligence, Wisdom, and Charisma saving throws."
    ],
    "url": "/api/2024/features/gnomish-cunning"
  },
  {
    "index": "gnomish-lineage",
    "species": {
      "index": "gnome",
      "name": "Gnome",
      "url": "/api/2024/species/gnome"
    },
    "name": "Gnomish Lineage",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You are part of a lineage that grants you supernatural abilities. Choose one of the following options; whichever one you choose, Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the lineage):",
      "Forest Gnome: You know the Minor Illusion cantrip. You also always have the Speak with Animals spell prepared. You can cast it without a spell slot a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Long Rest. You can also use any spell slots you have to cast the spell.",
      "Rock Gnome: You know the Mending and Prestidigitation cantrips. In addition, you can spend 10 minutes casting Prestidigitation to create a Tiny clockwork device (AC 5, 1 HP), such as a toy, fire starter, or music box. When you create the device, you determine its function by choosing one effect from Prestidigitation; the device produces that effect whenever you or another creature takes a Bonus Action to activate it with a touch. If the chosen effect has options within it, you choose one of those options for the device when you create it. You can have three such devices in existence at a time, and each falls apart 8 hours after its creation or when you dismantle it with a touch as a Utilize action."
    ],
    "url": "/api/2024/features/gnomish-lineage"
  },
  {
    "index": "giant-ancestry",
    "species": {
      "index": "goliath",
      "name": "Goliath",
      "url": "/api/2024/species/goliath"
    },
    "name": "Giant Ancestry",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You are descended from Giants. Choose one of the following benefits—a supernatural boon from your ancestry; you can use the chosen benefit a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Long Rest:",
      "Cloud's Jaunt (Cloud Giant): As a Bonus Action, you magically teleport up to 30 feet to an unoccupied space you can see.",
      "Fire's Burn (Fire Giant): When you hit a target with an attack roll and deal damage to it, you can also deal 1d10 Fire damage to that target.",
      "Frost's Chill (Frost Giant): When you hit a target with an attack roll and deal damage to it, you can also deal 1d6 Cold damage to that target and reduce its Speed by 10 feet until the start of your next turn.",
      "Hill's Tumble (Hill Giant): When you hit a Large or smaller creature with an attack roll and deal damage to it, you can give that target the Prone condition.",
      "Stone's Endurance (Stone Giant): When you take damage, you can take a Reaction to roll 1d12. Add your Constitution modifier to the number rolled and reduce the damage by that total.",
      "Storm's Thunder (Storm Giant): When you take damage from a creature within 60 feet of you, you can take a Reaction to deal 1d8 Thunder damage to that creature."
    ],
    "url": "/api/2024/features/giant-ancestry"
  },
  {
    "index": "large-form",
    "species": {
      "index": "goliath",
      "name": "Goliath",
      "url": "/api/2024/species/goliath"
    },
    "name": "Large Form",
    "level": 5,
    "prerequisites": [],
    "desc": [
      "Starting at character level 5, you can change your size to Large as a Bonus Action if you're in a big enough space. This transformation lasts for 10 minutes or until you end it (no action required).",
      "For that duration, you have Advantage on Strength checks, and your Speed increases by 10 feet.",
      "Once you use this trait, you can't use it again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/large-form"
  },
  {
    "index": "powerful-build",
    "species": {
      "index": "goliath",
      "name": "Goliath",
      "url": "/api/2024/species/goliath"
    },
    "name": "Powerful Build",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Advantage on any ability check you make to end the Grappled condition. You also count as one size larger when determining your carrying capacity."
    ],
    "url": "/api/2024/features/powerful-build"
  },
  {
    "index": "brave",
    "species": {
      "index": "halfling",
      "name": "Halfling",
      "url": "/api/2024/species/halfling"
    },
    "name": "Brave",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Advantage on saving throws you make to avoid or end the Frightened condition."
    ],
    "url": "/api/2024/features/brave"
  },
  {
    "index": "halfling-nimbleness",
    "species": {
      "index": "halfling",
      "name": "Halfling",
      "url": "/api/2024/species/halfling"
    },
    "name": "Halfling Nimbleness",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You can move through the space of any creature that is a size larger than you, but you can't stop in the same space."
    ],
    "url": "/api/2024/features/halfling-nimbleness"
  },
  {
    "index": "luck",
    "species": {
      "index": "halfling",
      "name": "Halfling",
      "url": "/api/2024/species/halfling"
    },
    "name": "Luck",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "When you roll a 1 on the d20 of a D20 Test, you can reroll the die, and you must use the new roll."
    ],
    "url": "/api/2024/features/luck"
  },
  {
    "index": "naturally-stealthy",
    "species": {
      "index": "halfling",
      "name": "Halfling",
      "url": "/api/2024/species/halfling"
    },
    "name": "Naturally Stealthy",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You can take the Hide action even when you are obscured only by a creature that is at least one size larger than you."
    ],
    "url": "/api/2024/features/naturally-stealthy"
  },
  {
    "index": "resourceful",
    "species": {
      "index": "human",
      "name": "Human",
      "url": "/api/2024/species/human"
    },
    "name": "Resourceful",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You gain Heroic Inspiration whenever you finish a Long Rest."
    ],
    "url": "/api/2024/features/resourceful"
  },
  {
    "index": "skillful",
    "species": {
      "index": "human",
      "name": "Human",
      "url": "/api/2024/species/human"
    },
    "name": "Skillful",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You gain proficiency in one skill of your choice."
    ],
    "url": "/api/2024/features/skillful"
  },
  {
    "index": "versatile",
    "species": {
      "index": "human",
      "name": "Human",
      "url": "/api/2024/species/human"
    },
    "name": "Versatile",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You gain an Origin feat of your choice (see \"Feats\"). Skilled is recommended."
    ],
    "url": "/api/2024/features/versatile"
  },
  {
    "index": "adrenaline-rush",
    "species": {
      "index": "orc",
      "name": "Orc",
      "url": "/api/2024/species/orc"
    },
    "name": "Adrenaline Rush",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You can take the Dash action as a Bonus Action. When you do so, you gain a number of Temporary Hit Points equal to your Proficiency Bonus.",
      "You can use this trait a number of times equal to your Proficiency Bonus, and you regain all expended uses when you finish a Short or Long Rest."
    ],
    "url": "/api/2024/features/adrenaline-rush"
  },
  {
    "index": "darkvision-orc",
    "species": {
      "index": "orc",
      "name": "Orc",
      "url": "/api/2024/species/orc"
    },
    "name": "Darkvision",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Darkvision with a range of 120 feet."
    ],
    "url": "/api/2024/features/darkvision-orc"
  },
  {
    "index": "relentless-endurance",
    "species": {
      "index": "orc",
      "name": "Orc",
      "url": "/api/2024/species/orc"
    },
    "name": "Relentless Endurance",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "When you are reduced to 0 Hit Points but not killed outright, you can drop to 1 Hit Point instead. Once you use this trait, you can't do so again until you finish a Long Rest."
    ],
    "url": "/api/2024/features/relentless-endurance"
  },
  {
    "index": "darkvision-tiefling",
    "species": {
      "index": "tiefling",
      "name": "Tiefling",
      "url": "/api/2024/species/tiefling"
    },
    "name": "Darkvision",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You have Darkvision with a range of 60 feet."
    ],
    "url": "/api/2024/features/darkvision-tiefling"
  },
  {
    "index": "fiendish-legacy",
    "species": {
      "index": "tiefling",
      "name": "Tiefling",
      "url": "/api/2024/species/tiefling"
    },
    "name": "Fiendish Legacy",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You are the recipient of a legacy that grants you supernatural abilities. Choose a legacy from the Fiendish Legacies table. You gain the level 1 benefit of the chosen legacy.",
      "When you reach character levels 3 and 5, you learn a higher-level spell, as shown on the table. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have of the appropriate level.",
      "Intelligence, Wisdom, or Charisma is your spellcasting ability for the spells you cast with this trait (choose the ability when you select the legacy)."
    ],
    "url": "/api/2024/features/fiendish-legacy"
  },
  {
    "index": "magic-initiate-cleric",
    "background": {
      "index": "acolyte",
      "name": "Acolyte",
      "url": "/api/2024/backgrounds/acolyte"
    },
    "name": "Magic Initiate (Cleric)",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You gain the following benefits:",
      "Two Cantrips: You learn two cantrips of your choice from the Cleric spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat).",
      "Level 1 Spell: Choose a level 1 spell from the Cleric spell list. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have.",
      "Spell Change: Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list."
    ],
    "url": "/api/2024/features/magic-initiate-cleric"
  },
  {
    "index": "alert",
    "background": {
      "index": "criminal",
      "name": "Criminal",
      "url": "/api/2024/backgrounds/criminal"
    },
    "name": "Alert",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You gain the following benefits:",
      "Initiative Proficiency: When you roll Initiative, you can add your Proficiency Bonus to the roll.",
      "Initiative Swap: Immediately after you roll Initiative, you can swap your Initiative with the Initiative of one willing ally in the same combat. You can't make this swap if you or the ally has the Incapacitated condition."
    ],
    "url": "/api/2024/features/alert"
  },
  {
    "index": "magic-initiate-wizard",
    "background": {
      "index": "sage",
      "name": "Sage",
      "url": "/api/2024/backgrounds/sage"
    },
    "name": "Magic Initiate (Wizard)",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You gain the following benefits:",
      "Two Cantrips: You learn two cantrips of your choice from the Wizard spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat).",
      "Level 1 Spell: Choose a level 1 spell from the Wizard spell list. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have.",
      "Spell Change: Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list."
    ],
    "url": "/api/2024/features/magic-initiate-wizard"
  },
  {
    "index": "savage-attacker",
    "background": {
      "index": "soldier",
      "name": "Soldier",
      "url": "/api/2024/backgrounds/soldier"
    },
    "name": "Savage Attacker",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You've trained to deal particularly damaging strikes. Once per turn when you hit a target with a weapon, you can roll the weapon's damage dice twice and use either roll against the target."
    ],
    "url": "/api/2024/features/savage-attacker"
  },
  {
    "index": "skilled",
    "feat": {
      "index": "skilled",
      "name": "Skilled",
      "url": "/api/2024/feats/skilled"
    },
    "name": "Skilled",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You gain proficiency in any combination of three skills or tools of your choice.",
      "Repeatable: You can take this feat more than once."
    ],
    "url": "/api/2024/features/skilled"
  },
  {
    "index": "ability-score-improvement-feat",
    "feat": {
      "index": "ability-score-improvement",
      "name": "Ability Score Improvement",
      "url": "/api/2024/feats/ability-score-improvement"
    },
    "name": "Ability Score Improvement",
    "level": 4,
    "prerequisites": ["Level 4+"],
    "desc": [
      "Increase one ability score of your choice by 2, or increase two ability scores of your choice by 1. This feat can't increase an ability score above 20.",
      "Repeatable: You can take this feat more than once."
    ],
    "url": "/api/2024/features/ability-score-improvement-feat"
  },
  {
    "index": "grappler",
    "feat": {
      "index": "grappler",
      "name": "Grappler",
      "url": "/api/2024/feats/grappler"
    },
    "name": "Grappler",
    "level": 4,
    "prerequisites": ["Level 4+", "Strength or Dexterity 13+"],
    "desc": [
      "You gain the following benefits:",
      "Ability Score Increase: Increase your Strength or Dexterity score by 1, to a maximum of 20.",
      "Punch and Grab: When you hit a creature with an Unarmed Strike as part of the Attack action on your turn, you can use both the Damage and the Grapple option. You can use this benefit only once per turn.",
      "Attack Advantage: You have Advantage on attack rolls against a creature Grappled by you.",
      "Fast Wrestler: You don't have to spend extra movement to move a creature Grappled by you if the creature is your size or smaller."
    ],
    "url": "/api/2024/features/grappler"
  },
  {
    "index": "archery",
    "feat": {
      "index": "archery",
      "name": "Archery",
      "url": "/api/2024/feats/archery"
    },
    "name": "Archery",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "desc": [
      "You gain a +2 bonus to attack rolls you make with Ranged weapons."
    ],
    "url": "/api/2024/features/archery"
  },
  {
    "index": "defense",
    "feat": {
      "index": "defense",
      "name": "Defense",
      "url": "/api/2024/feats/defense"
    },
    "name": "Defense",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "desc": [
      "While you're wearing Light, Medium, or Heavy armor, you gain a +1 bonus to Armor Class."
    ],
    "url": "/api/2024/features/defense"
  },
  {
    "index": "great-weapon-fighting",
    "feat": {
      "index": "great-weapon-fighting",
      "name": "Great Weapon Fighting",
      "url": "/api/2024/feats/great-weapon-fighting"
    },
    "name": "Great Weapon Fighting",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "desc": [
      "When you roll damage for an attack you make with a Melee weapon that you are holding with two hands, you can treat any 1 or 2 on a damage die as a 3. The weapon must have the Two-Handed or Versatile property to gain this benefit."
    ],
    "url": "/api/2024/features/great-weapon-fighting"
  },
  {
    "index": "two-weapon-fighting",
    "feat": {
      "index": "two-weapon-fighting",
      "name": "Two-Weapon Fighting",
      "url": "/api/2024/feats/two-weapon-fighting"
    },
    "name": "Two-Weapon Fighting",
    "level": 1,
    "prerequisites": ["Fighting Style Feature"],
    "desc": [
      "When you make an extra attack as a result of using a weapon that has the Light property, you can add your ability modifier to the damage of that attack if you aren't already adding it to the damage."
    ],
    "url": "/api/2024/features/two-weapon-fighting"
  },
  {
    "index": "boon-of-combat-prowess",
    "feat": {
      "index": "boon-of-combat-prowess",
      "name": "Boon of Combat Prowess",
      "url": "/api/2024/feats/boon-of-combat-prowess"
    },
    "name": "Boon of Combat Prowess",
    "level": 19,
    "prerequisites": ["Level 19+"],
    "desc": [
      "You gain the following benefits:",
      "Ability Score Increase: Increase one ability score of your choice by 1, to a maximum of 30.",
      "Peerless Aim: When you miss with an attack roll, you can hit instead. Once you use this benefit, you can't use it again until the start of your next turn."
    ],
    "url": "/api/2024/features/boon-of-combat-prowess"
  },
  {
    "index": "boon-of-dimensional-travel",
    "feat": {
      "index": "boon-of-dimensional-travel",
      "name": "Boon of Dimensional Travel",
      "url": "/api/2024/feats/boon-of-dimensional-travel"
    },
    "name": "Boon of Dimensional Travel",
    "level": 19,
    "prerequisites": ["Level 19+"],
    "desc": [
      "You gain the following benefits:",
      "Ability Score Increase: Increase one ability score of your choice by 1, to a maximum of 30.",
      "Blink Steps: Immediately after you take the Attack action or the Magic action, you can teleport up to 30 feet to an unoccupied space you can see."
    ],
    "url": "/api/2024/features/boon-of-dimensional-travel"
  },
  {
    "index": "boon-of-fate",
    "feat": {
      "index": "boon-of-fate",
      "name": "Boon of Fate",
      "url": "/api/2024/feats/boon-of-fate"
    },
    "name": "Boon of Fate",
    "level": 19,
    "prerequisites": ["Level 19+"],
    "desc": [
      "You gain the following benefits:",
      "Ability Score Increase: Increase one ability score of your choice by 1, to a maximum of 30.",
      "Improve Fate: When you or another creature within 60 feet of you succeeds on or fails a D20 Test, you can roll 2d4 and apply the total rolled as a bonus or penalty to the d20 roll. Once you use this benefit, you can't use it again until you roll Initiative or finish a Short or Long Rest."
    ],
    "url": "/api/2024/features/boon-of-fate"
  },
  {
    "index": "boon-of-irresistible-offense",
    "feat": {
      "index": "boon-of-irresistible-offense",
      "name": "Boon of Irresistible Offense",
      "url": "/api/2024/feats/boon-of-irresistible-offense"
    },
    "name": "Boon of Irresistible Offense",
    "level": 19,
    "prerequisites": ["Level 19+"],
    "desc": [
      "You gain the following benefits:",
      "Ability Score Increase: Increase your Strength or Dexterity score by 1, to a maximum of 30.",
      "Overcome Defenses: The Bludgeoning, Piercing, and Slashing damage you deal always ignores Resistance.",
      "Overwhelming Strike: When you roll a 20 on the d20 for an attack roll, you can deal extra damage to the target equal to the ability score increased by this feat. The extra damage's type is the same as the attack's type."
    ],
    "url": "/api/2024/features/boon-of-irresistible-offense"
  },
  {
    "index": "boon-of-spell-recall",
    "feat": {
      "index": "boon-of-spell-recall",
      "name": "Boon of Spell Recall",
      "url": "/api/2024/feats/boon-of-spell-recall"
    },
    "name": "Boon of Spell Recall",
    "level": 19,
    "prerequisites": ["Level 19+", "Spellcasting Feature"],
    "desc": [
      "You gain the following benefits:",
      "Ability Score Increase: Increase your Intelligence, Wisdom, or Charisma score by 1, to a maximum of 30.",
      "Free Casting: Whenever you cast a spell with a level 1–4 spell slot, roll 1d4. If the number you roll is the same as the slot's level, the slot isn't expended."
    ],
    "url": "/api/2024/features/boon-of-spell-recall"
  },
  {
    "index": "boon-of-the-night-spirit",
    "feat": {
      "index": "boon-of-the-night-spirit",
      "name": "Boon of the Night Spirit",
      "url": "/api/2024/feats/boon-of-the-night-spirit"
    },
    "name": "Boon of the Night Spirit",
    "level": 19,
    "prerequisites": ["Level 19+"],
    "desc": [
      "You gain the following benefits:",
      "Ability Score Increase: Increase one ability score of your choice by 1, to a maximum of 30.",
      "Merge with Shadows: While within Dim Light or Darkness, you can give yourself the Invisible condition as a Bonus Action. The condition ends on you immediately after you take an action, a Bonus Action, or a Reaction.",
      "Shadowy Form: While within Dim Light or Darkness, you have Resistance to all damage except Psychic and Radiant."
    ],
    "url": "/api/2024/features/boon-of-the-night-spirit"
  },
  {
    "index": "magic-initiate-druid",
    "feat": {
      "index": "magic-initiate",
      "name": "Magic Initiate",
      "url": "/api/2024/feats/magic-initiate"
    },
    "name": "Magic Initiate (Druid)",
    "level": 1,
    "prerequisites": [],
    "desc": [
      "You gain the following benefits:",
      "Two Cantrips: You learn two cantrips of your choice from the Druid spell list. Intelligence, Wisdom, or Charisma is your spellcasting ability for this feat's spells (choose when you select this feat).",
      "Level 1 Spell: Choose a level 1 spell from the Druid spell list. You always have that spell prepared. You can cast it once without a spell slot, and you regain the ability to cast it in that way when you finish a Long Rest. You can also cast the spell using any spell slots you have.",
      "Spell Change: Whenever you gain a new level, you can replace one of the spells you chose for this feat with a different spell of the same level from the chosen spell list."
    ],
    "url": "/api/2024/features/magic-initiate-druid"
  },
  {
    "index": "boon-of-truesight",
    "feat": {
      "index": "boon-of-truesight",
      "name": "Boon of Truesight",
      "url": "/api/2024/feats/boon-of-truesight"
    },
    "name": "Boon of Truesight",
    "level": 19,
    "prerequisites": ["Level 19+"],
    "desc": [
      "You gain the following benefits:",
      "Ability Score Increase: Increase one ability score of your choice by 1, to a maximum of 30.",
      "Truesight: You have Truesight with a range of 60 feet."
    ],
    "url": "/api/2024/features/boon-of-truesight"
  }
]